klactrafob/esp32-c3_matter/src/core/modules.c
#include "core/modules.h"

#include <stdint.h>
#include <inttypes.h>
#include <stdarg.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <time.h>

#include "aht20.h"
#include "bme280.h"
#include "ds18b20.h"
#include "driver/gpio.h"
#include "driver/ledc.h"
#include "esp_adc/adc_oneshot.h"
#include "esp_check.h"
#include "esp_log.h"
#include "esp_rom_sys.h"
#include "esp_timer.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "i2c_bus.h"
#include "led_strip.h"
#include "onewire_bus.h"
#include "soc/soc_caps.h"
#include "sht3x.h"

#include "app_watchdog.h"

static const char *TAG = "modules";

#define MODULES_MAX_OUTPUTS 8
#define MODULES_MAX_INPUTS 8
#define MODULES_MAX_BUTTONS 8
#define MODULES_MAX_SENSORS 4
#define MODULES_MAX_DS18B20 8
#define MODULES_POLL_PERIOD_MS 50
#define MODULES_SENSOR_TASK_PERIOD_MS 200
#define SERVO_3WIRE_HOLD_MS_DEFAULT 1200
#define MODULES_DEFAULT_I2C_PORT I2C_NUM_0
#define LEVEL_PCT_MAX 100
#define WS2812_BRIGHTNESS_MAX 255

typedef enum {
    OUTPUT_TYPE_NONE = 0,
    OUTPUT_TYPE_RELAY,
    OUTPUT_TYPE_PWM,
    OUTPUT_TYPE_WS2812,
    OUTPUT_TYPE_SERVO_3WIRE,
    OUTPUT_TYPE_SERVO_5WIRE,
    OUTPUT_TYPE_CLOCK_4X4094,
    OUTPUT_TYPE_STEPPER_28BYJ,
    OUTPUT_TYPE_STEPPER_A4988,
} output_type_t;

typedef enum {
    WS2812_MODE_RGB = 0,
    WS2812_MODE_MONO_TRIPLET,
} ws2812_mode_t;

typedef enum {
    WS2812_TRANSITION_NONE = 0,
    WS2812_TRANSITION_FADE,
    WS2812_TRANSITION_WIPE,
} ws2812_transition_style_t;

typedef enum {
    ACTION_NONE = 0,
    ACTION_TOGGLE_OUTPUT,
    ACTION_SET_OUTPUT,
    ACTION_MASTER_ON,
    ACTION_MASTER_OFF,
    ACTION_MASTER_TOGGLE,
    ACTION_DIM_STEP_UP,
    ACTION_DIM_STEP_DOWN,
} button_action_type_t;

typedef struct {
    button_action_type_t type;
    char target[24];
    bool value;
    int step;
} button_action_t;

typedef struct {
    bool used;
    bool enabled;
    output_type_t type;
    char id[24];
    char name[40];
    char role[16];
    char mqtt_component[16];
    char mqtt_number_mode[16];
    int gpio;
    bool power;
    bool supported;
    bool test_active;
    int64_t test_restore_at_us;
    bool test_restore_power;
    int test_restore_level;
    uint8_t test_restore_red;
    uint8_t test_restore_green;
    uint8_t test_restore_blue;
    union {
        struct {
            int active_level;
            bool default_on;
        } relay;
        struct {
            bool inverted;
            int freq_hz;
            int level;
            int max_level_pct;
            int power_relay_gpio;
            int power_relay_active_level;
            ledc_channel_t channel;
            ledc_timer_t timer;
        } pwm;
        struct {
            int pixel_count;
            char color_order[8];
            bool default_power_on;
            bool gamma_correction;
            int level;
            uint8_t red;
            uint8_t green;
            uint8_t blue;
            ws2812_mode_t mode;
            ws2812_transition_style_t transition_style;
            int transition_ms;
            int applied_level;
            uint8_t applied_red;
            uint8_t applied_green;
            uint8_t applied_blue;
            bool transition_active;
            bool transition_use_wipe;
            int64_t transition_started_us;
            int64_t transition_duration_us;
            int start_level;
            int target_level;
            uint8_t start_red;
            uint8_t start_green;
            uint8_t start_blue;
            uint8_t target_red;
            uint8_t target_green;
            uint8_t target_blue;
            led_strip_handle_t strip;
        } ws2812;
        struct {
            int level;
            int min_us;
            int max_us;
            bool reverse_direction;
            int hold_power_ms;
            int64_t release_at_us;
            ledc_channel_t channel;
            ledc_timer_t timer;
        } servo_3wire;
        struct {
            int gpio_b;
            int feedback_gpio;
            int feedback_min_raw;
            int feedback_max_raw;
            int deadband_pct;
            int move_timeout_ms;
            bool reverse_direction;
            adc_channel_t adc_channel;
            int target_level;
            int current_level;
            int feedback_raw;
            int drive_state;
            bool moving;
            bool timed_out;
            int64_t drive_started_us;
        } servo_5wire;
        struct {
            int gpio_b;
            int gpio_c;
            int brightness_gpio;
            uint8_t segment_map[8];
            int level;
            int blink_period_ms;
            int timezone_offset_min;
            bool default_on;
            bool common_anode;
            bool mirror_segments;
            bool reverse_digits;
            bool leading_zero;
            bool blink_separator;
            bool time_valid;
            bool separator_on;
            int display_hour;
            int display_minute;
            int64_t last_render_us;
            char display_text[8];
            uint8_t segments[4];
            ledc_channel_t channel;
            ledc_timer_t timer;
        } clock_4x4094;
        struct {
            int gpio_b;
            int gpio_c;
            int gpio_d;
            int home_gpio;
            gpio_pull_mode_t home_pull_mode;
            bool home_inverted;
            bool auto_home_on_boot;
            int steps_range;
            int speed_steps_per_sec;
            bool reverse_direction;
            bool hold_enabled;
            int target_level;
            int current_level;
            int target_position_steps;
            int current_position_steps;
            int phase_index;
            bool home_active;
            bool homing;
            bool homed;
            bool moving;
            int64_t last_step_us;
        } stepper_28byj;
        struct {
            int gpio_b;
            int gpio_c;
            int home_gpio;
            gpio_pull_mode_t home_pull_mode;
            bool home_inverted;
            bool auto_home_on_boot;
            int enable_active_level;
            int steps_range;
            int speed_steps_per_sec;
            int step_pulse_us;
            bool reverse_direction;
            bool hold_enabled;
            int target_level;
            int current_level;
            int target_position_steps;
            int current_position_steps;
            bool home_active;
            bool homing;
            bool homed;
            bool moving;
            int64_t last_step_us;
        } stepper_a4988;
    } cfg;
} output_runtime_t;

