klactrafob/esp32-c3_matter/src/core/modules.c
typedef struct {
    bool used;
    bool enabled;
    char id[24];
    char name[40];
    char role[24];
    int gpio;
    bool inverted;
    gpio_pull_mode_t pull_mode;
    bool state;
} input_runtime_t;

typedef struct {
    bool used;
    bool enabled;
    char id[24];
    char name[40];
    int gpio;
    bool inverted;
    gpio_pull_mode_t pull_mode;
    int long_press_ms;
    bool last_pressed;
    bool long_sent;
    int64_t pressed_since_us;
    button_action_t short_action;
    button_action_t long_action;
} button_runtime_t;

typedef struct {
    bool used;
    bool enabled;
    char id[24];
    char name[40];
    char type[24];
    bool supported;
    bool data_valid;
    int gpio;
    int sda_gpio;
    int scl_gpio;
    int address;
    int poll_interval_sec;
    int64_t next_poll_us;
    float temperature_c;
    float humidity_pct;
    float pressure_hpa;
    union {
        aht20_dev_handle_t aht20;
        sht3x_handle_t sht3x;
        bme280_handle_t bme280;
    } dev;
} sensor_runtime_t;

typedef struct {
    bool active;
    int sda_gpio;
    int scl_gpio;
    int freq_hz;
    i2c_bus_handle_t bus;
} i2c_runtime_t;

typedef struct {
    bool active;
    int gpio;
    onewire_bus_handle_t bus;
    ds18b20_device_handle_t devices[MODULES_MAX_DS18B20];
    onewire_device_address_t addresses[MODULES_MAX_DS18B20];
    float temperatures[MODULES_MAX_DS18B20];
    bool valid[MODULES_MAX_DS18B20];
    int device_count;
    int poll_interval_sec;
    int64_t next_poll_us;
    char sensor_id[24];
    char sensor_name[40];
} ds18b20_bus_runtime_t;

typedef struct {
    bool active;
    adc_oneshot_unit_handle_t handle;
    uint32_t configured_mask;
} adc_runtime_t;

typedef struct {
    bool used;
    int freq_hz;
    ledc_timer_bit_t duty_resolution;
    ledc_timer_t timer;
} ledc_timer_allocation_t;

typedef struct {
    ledc_timer_allocation_t timers[SOC_LEDC_TIMER_NUM];
    int timer_count;
    int next_channel;
} ledc_allocator_t;

typedef struct {
    output_runtime_t outputs[MODULES_MAX_OUTPUTS];
    int output_count;
    input_runtime_t inputs[MODULES_MAX_INPUTS];
    int input_count;
    button_runtime_t buttons[MODULES_MAX_BUTTONS];
    int button_count;
    sensor_runtime_t sensors[MODULES_MAX_SENSORS];
    int sensor_count;
    i2c_runtime_t i2c;
    ds18b20_bus_runtime_t ds18b20;
    adc_runtime_t adc;
} modules_runtime_t;

static modules_runtime_t s_runtime = {0};
static char s_last_error[192] = "";
static SemaphoreHandle_t s_lock = NULL;
static TaskHandle_t s_poll_task = NULL;
static TaskHandle_t s_sensor_task = NULL;
static modules_runtime_callback_t s_runtime_cb = NULL;
static void *s_runtime_cb_ctx = NULL;

static void set_last_error(const char *fmt, ...)
{
    va_list ap;
    va_start(ap, fmt);
    vsnprintf(s_last_error, sizeof(s_last_error), fmt, ap);
    va_end(ap);
}

static void clear_last_error(void)
{
    s_last_error[0] = 0;
}

static const cJSON *jobj(const cJSON *obj, const char *key);
static const char *jstr(const cJSON *obj, const char *key, const char *def);
static bool jbool(const cJSON *obj, const char *key, bool def);
static int jint(const cJSON *obj, const char *key, int def);
static gpio_pull_mode_t pull_mode_from_text(const char *pull);
static const char *pull_mode_to_text(gpio_pull_mode_t pull);
static output_type_t output_type_from_text(const char *type);
static const char *output_type_to_text(output_type_t type);
static ws2812_mode_t ws2812_mode_from_text(const char *mode);
static const char *ws2812_mode_to_text(ws2812_mode_t mode);
static ws2812_transition_style_t ws2812_transition_style_from_text(const char *style);
static const char *ws2812_transition_style_to_text(ws2812_transition_style_t style);
static button_action_type_t button_action_type_from_text(const char *type);
static const char *button_action_type_to_text(button_action_type_t type);
static void notify_runtime_changed(void);
static esp_err_t output_apply_physical_state(output_runtime_t *out);
static esp_err_t set_output_power_locked(output_runtime_t *out, bool on);
static esp_err_t set_output_level_locked(output_runtime_t *out, int level);
static esp_err_t set_output_brightness_locked(output_runtime_t *out, int brightness);
static esp_err_t set_master_output_locked(bool on);
static bool is_any_output_on_locked(void);
static output_runtime_t *find_output_locked(const char *id);
static input_runtime_t *find_input_locked(const char *id);
static cJSON *build_output_status_json(const output_runtime_t *out);
static cJSON *build_input_status_json(const input_runtime_t *in);
static cJSON *build_button_status_json(const button_runtime_t *btn);
static cJSON *build_sensor_status_json(const sensor_runtime_t *sensor);
static esp_err_t start_output_test_locked(output_runtime_t *out, int duration_ms);
static bool process_output_test_locked(output_runtime_t *out, int64_t now_us);
static esp_err_t ensure_i2c_bus_locked(int sda_gpio, int scl_gpio, int freq_hz);
static esp_err_t ensure_ds18b20_bus_locked(const sensor_runtime_t *sensor);
static esp_err_t ensure_adc_channel_locked(int gpio, adc_channel_t *out_channel);
static esp_err_t read_sensor_locked(sensor_runtime_t *sensor);
static const char *normalize_output_mqtt_component(const char *value);
static const char *normalize_output_mqtt_number_mode(const char *value);
static esp_err_t enumerate_ds18b20_devices_locked(int gpio, bool *out_topology_changed);
static esp_err_t read_ds18b20_locked(bool *out_topology_changed);
static esp_err_t set_pwm_power_relay_locked(output_runtime_t *out, bool on);
static bool output_supports_power_control(const output_runtime_t *out);
static bool output_supports_level_control(const output_runtime_t *out);
static bool output_is_cover(const output_runtime_t *out);
static const char *cover_state_text_locked(const output_runtime_t *out);
static esp_err_t servo_5wire_set_drive_locked(output_runtime_t *out, int logical_direction);
static int servo_5wire_feedback_to_level_locked(const output_runtime_t *out, int raw);
static esp_err_t servo_5wire_read_feedback_locked(output_runtime_t *out, int *out_raw, int *out_level);
static bool update_servo_3wire_release_locked(output_runtime_t *out, int64_t now_us);
static bool update_servo_5wire_control_locked(output_runtime_t *out, int64_t now_us);
static int stepper_level_to_position(int level, int steps_range);
static int stepper_position_to_level(int position_steps, int steps_range);
static esp_err_t stepper_28byj_apply_phase_locked(output_runtime_t *out, int phase_index);
static esp_err_t stepper_28byj_release_locked(output_runtime_t *out);
static bool stepper_28byj_home_active_locked(output_runtime_t *out);
static void stepper_28byj_finish_home_locked(output_runtime_t *out);
static esp_err_t stepper_28byj_start_home_locked(output_runtime_t *out);
static esp_err_t stepper_28byj_stop_locked(output_runtime_t *out);
static esp_err_t stepper_a4988_set_enable_locked(output_runtime_t *out, bool enabled);
static esp_err_t stepper_a4988_step_locked(output_runtime_t *out, int logical_direction);
static bool stepper_a4988_home_active_locked(output_runtime_t *out);
static void stepper_a4988_finish_home_locked(output_runtime_t *out);
static esp_err_t stepper_a4988_start_home_locked(output_runtime_t *out);
static esp_err_t stepper_a4988_stop_locked(output_runtime_t *out);
static bool update_stepper_28byj_control_locked(output_runtime_t *out, int64_t now_us);
static bool update_stepper_a4988_control_locked(output_runtime_t *out, int64_t now_us);

const char *modules_last_error(void)
{
    return s_last_error[0] ? s_last_error : "unknown module error";
}
static esp_err_t clock_4x4094_apply_state_locked(output_runtime_t *out, int64_t now_us, bool force_render);
static bool update_clock_4x4094_locked(output_runtime_t *out, int64_t now_us);
static esp_err_t render_ws2812_frame_locked(output_runtime_t *out, int level, uint8_t red, uint8_t green, uint8_t blue, int wipe_active_segments);
static esp_err_t apply_ws2812_target_locked(output_runtime_t *out, bool allow_transition);
static void update_ws2812_transitions_locked(int64_t now_us);
static bool output_uses_plain_gpio(output_type_t type);
static esp_err_t ledc_allocator_acquire(ledc_allocator_t *alloc, int freq_hz, ledc_timer_bit_t duty_resolution,
                                        ledc_channel_t *out_channel, ledc_timer_t *out_timer);

static const cJSON *jobj(const cJSON *obj, const char *key)
{
    if (!cJSON_IsObject((cJSON *)obj)) {
        return NULL;
    }
    return cJSON_GetObjectItemCaseSensitive((cJSON *)obj, key);
}

static const char *jstr(const cJSON *obj, const char *key, const char *def)
{
    const cJSON *it = jobj(obj, key);
    if (cJSON_IsString(it) && it->valuestring) {
        return it->valuestring;
    }
    return def;
}

static bool jbool(const cJSON *obj, const char *key, bool def)
{
    const cJSON *it = jobj(obj, key);
    if (cJSON_IsBool(it)) {
        return cJSON_IsTrue(it);
    }
    return def;
}

static int jint(const cJSON *obj, const char *key, int def)
{
    const cJSON *it = jobj(obj, key);
    if (cJSON_IsNumber(it)) {
        return it->valueint;
    }
    return def;
}

