klactrafob/esp32-c3_matter/src/core/modules.c
static gpio_pull_mode_t pull_mode_from_text(const char *pull)
{
    if (strcmp(pull, "down") == 0) {
        return GPIO_PULLDOWN_ONLY;
    }
    if (strcmp(pull, "none") == 0) {
        return GPIO_FLOATING;
    }
    return GPIO_PULLUP_ONLY;
}

static const char *pull_mode_to_text(gpio_pull_mode_t pull)
{
    switch (pull) {
        case GPIO_PULLDOWN_ONLY:
            return "down";
        case GPIO_FLOATING:
            return "none";
        case GPIO_PULLUP_ONLY:
        default:
            return "up";
    }
}

static output_type_t output_type_from_text(const char *type)
{
    if (strcmp(type, "relay") == 0) {
        return OUTPUT_TYPE_RELAY;
    }
    if (strcmp(type, "pwm") == 0) {
        return OUTPUT_TYPE_PWM;
    }
    if (strcmp(type, "ws2812") == 0) {
        return OUTPUT_TYPE_WS2812;
    }
    if (strcmp(type, "servo_3wire") == 0) {
        return OUTPUT_TYPE_SERVO_3WIRE;
    }
    if (strcmp(type, "servo_5wire") == 0) {
        return OUTPUT_TYPE_SERVO_5WIRE;
    }
    if (strcmp(type, "clock_4x4094") == 0) {
        return OUTPUT_TYPE_CLOCK_4X4094;
    }
    if (strcmp(type, "stepper_28byj") == 0) {
        return OUTPUT_TYPE_STEPPER_28BYJ;
    }
    if (strcmp(type, "stepper_a4988") == 0) {
        return OUTPUT_TYPE_STEPPER_A4988;
    }
    return OUTPUT_TYPE_NONE;
}

static const char *output_type_to_text(output_type_t type)
{
    switch (type) {
        case OUTPUT_TYPE_RELAY: return "relay";
        case OUTPUT_TYPE_PWM: return "pwm";
        case OUTPUT_TYPE_WS2812: return "ws2812";
        case OUTPUT_TYPE_SERVO_3WIRE: return "servo_3wire";
        case OUTPUT_TYPE_SERVO_5WIRE: return "servo_5wire";
        case OUTPUT_TYPE_CLOCK_4X4094: return "clock_4x4094";
        case OUTPUT_TYPE_STEPPER_28BYJ: return "stepper_28byj";
        case OUTPUT_TYPE_STEPPER_A4988: return "stepper_a4988";
        default: return "unknown";
    }
}

static const char *normalize_output_mqtt_component(const char *value)
{
    if (value && strcmp(value, "number") == 0) {
        return "number";
    }
    if (value && strcmp(value, "light") == 0) {
        return "light";
    }
    if (value && strcmp(value, "cover") == 0) {
        return "cover";
    }
    return "auto";
}

static const char *normalize_output_mqtt_number_mode(const char *value)
{
    if (value && strcmp(value, "box") == 0) {
        return "box";
    }
    if (value && strcmp(value, "auto") == 0) {
        return "auto";
    }
    return "slider";
}

static ws2812_mode_t ws2812_mode_from_text(const char *mode)
{
    if (strcmp(mode, "mono_triplet") == 0) {
        return WS2812_MODE_MONO_TRIPLET;
    }
    return WS2812_MODE_RGB;
}

static const char *ws2812_mode_to_text(ws2812_mode_t mode)
{
    switch (mode) {
        case WS2812_MODE_MONO_TRIPLET: return "mono_triplet";
        case WS2812_MODE_RGB:
        default: return "rgb";
    }
}

static ws2812_transition_style_t ws2812_transition_style_from_text(const char *style)
{
    if (strcmp(style, "fade") == 0) {
        return WS2812_TRANSITION_FADE;
    }
    if (strcmp(style, "wipe") == 0) {
        return WS2812_TRANSITION_WIPE;
    }
    return WS2812_TRANSITION_NONE;
}

static const char *ws2812_transition_style_to_text(ws2812_transition_style_t style)
{
    switch (style) {
        case WS2812_TRANSITION_FADE: return "fade";
        case WS2812_TRANSITION_WIPE: return "wipe";
        case WS2812_TRANSITION_NONE:
        default: return "none";
    }
}

static button_action_type_t button_action_type_from_text(const char *type)
{
    if (strcmp(type, "toggle_output") == 0) {
        return ACTION_TOGGLE_OUTPUT;
    }
    if (strcmp(type, "set_output") == 0) {
        return ACTION_SET_OUTPUT;
    }
    if (strcmp(type, "master_on") == 0) {
        return ACTION_MASTER_ON;
    }
    if (strcmp(type, "master_off") == 0) {
        return ACTION_MASTER_OFF;
    }
    if (strcmp(type, "master_toggle") == 0) {
        return ACTION_MASTER_TOGGLE;
    }
    if (strcmp(type, "dim_step_up") == 0) {
        return ACTION_DIM_STEP_UP;
    }
    if (strcmp(type, "dim_step_down") == 0) {
        return ACTION_DIM_STEP_DOWN;
    }
    return ACTION_NONE;
}

static const char *button_action_type_to_text(button_action_type_t type)
{
    switch (type) {
        case ACTION_TOGGLE_OUTPUT: return "toggle_output";
        case ACTION_SET_OUTPUT: return "set_output";
        case ACTION_MASTER_ON: return "master_on";
        case ACTION_MASTER_OFF: return "master_off";
        case ACTION_MASTER_TOGGLE: return "master_toggle";
        case ACTION_DIM_STEP_UP: return "dim_step_up";
        case ACTION_DIM_STEP_DOWN: return "dim_step_down";
        default: return "none";
    }
}

static void notify_runtime_changed(void)
{
    if (s_runtime_cb) {
        s_runtime_cb(s_runtime_cb_ctx);
    }
}

static bool output_uses_plain_gpio(output_type_t type)
{
    return type == OUTPUT_TYPE_RELAY ||
           type == OUTPUT_TYPE_SERVO_5WIRE ||
           type == OUTPUT_TYPE_CLOCK_4X4094 ||
           type == OUTPUT_TYPE_STEPPER_28BYJ ||
           type == OUTPUT_TYPE_STEPPER_A4988;
}

static esp_err_t ledc_allocator_acquire(ledc_allocator_t *alloc, int freq_hz, ledc_timer_bit_t duty_resolution,
                                        ledc_channel_t *out_channel, ledc_timer_t *out_timer)
{
    int timer_index = -1;

    if (!alloc || !out_channel || !out_timer || freq_hz <= 0) {
        return ESP_ERR_INVALID_ARG;
    }

    for (int i = 0; i < alloc->timer_count; ++i) {
        if (alloc->timers[i].used &&
            alloc->timers[i].freq_hz == freq_hz &&
            alloc->timers[i].duty_resolution == duty_resolution) {
            timer_index = i;
            break;
        }
    }

    if (timer_index < 0) {
        if (alloc->timer_count >= SOC_LEDC_TIMER_NUM) {
            return ESP_ERR_NOT_SUPPORTED;
        }
        timer_index = alloc->timer_count++;
        alloc->timers[timer_index].used = true;
        alloc->timers[timer_index].freq_hz = freq_hz;
        alloc->timers[timer_index].duty_resolution = duty_resolution;
        alloc->timers[timer_index].timer = (ledc_timer_t)timer_index;
    }

    if (alloc->next_channel >= SOC_LEDC_CHANNEL_NUM) {
        return ESP_ERR_NOT_SUPPORTED;
    }

