klactrafob/esp32-c3_matter/src/core/modules.c
    *out_channel = (ledc_channel_t)alloc->next_channel++;
    *out_timer = alloc->timers[timer_index].timer;
    return ESP_OK;
}

static bool output_supports_power_control(const output_runtime_t *out)
{
    if (!out) {
        return false;
    }

    return out->type == OUTPUT_TYPE_RELAY ||
           out->type == OUTPUT_TYPE_PWM ||
           out->type == OUTPUT_TYPE_WS2812 ||
           out->type == OUTPUT_TYPE_CLOCK_4X4094;
}

static bool output_supports_level_control(const output_runtime_t *out)
{
    if (!out) {
        return false;
    }

    return out->type == OUTPUT_TYPE_PWM ||
           out->type == OUTPUT_TYPE_WS2812 ||
           out->type == OUTPUT_TYPE_SERVO_3WIRE ||
           out->type == OUTPUT_TYPE_SERVO_5WIRE ||
           out->type == OUTPUT_TYPE_CLOCK_4X4094 ||
           out->type == OUTPUT_TYPE_STEPPER_28BYJ ||
           out->type == OUTPUT_TYPE_STEPPER_A4988;
}

static bool output_is_cover(const output_runtime_t *out)
{
    if (!out) {
        return false;
    }

    return (out->type == OUTPUT_TYPE_STEPPER_28BYJ ||
            out->type == OUTPUT_TYPE_STEPPER_A4988) &&
           strcmp(out->role, "cover") == 0;
}

static const char *cover_state_text_locked(const output_runtime_t *out)
{
    if (!output_is_cover(out)) {
        return "stopped";
    }

    if (out->type == OUTPUT_TYPE_STEPPER_28BYJ) {
        if (out->cfg.stepper_28byj.homing) {
            return "homing";
        }
        if (out->cfg.stepper_28byj.home_gpio >= 0 && !out->cfg.stepper_28byj.homed) {
            return "not_homed";
        }
        if (out->cfg.stepper_28byj.moving) {
            return (out->cfg.stepper_28byj.target_level >= out->cfg.stepper_28byj.current_level) ?
                "opening" : "closing";
        }
        return "stopped";
    }

    if (out->type == OUTPUT_TYPE_STEPPER_A4988) {
        if (out->cfg.stepper_a4988.homing) {
            return "homing";
        }
        if (out->cfg.stepper_a4988.home_gpio >= 0 && !out->cfg.stepper_a4988.homed) {
            return "not_homed";
        }
        if (out->cfg.stepper_a4988.moving) {
            return (out->cfg.stepper_a4988.target_level >= out->cfg.stepper_a4988.current_level) ?
                "opening" : "closing";
        }
    }

    return "stopped";
}

static bool clock_time_is_valid(void)
{
    time_t now = time(NULL);
    return now >= 1704067200; // 2024-01-01 UTC
}

static uint8_t clock_4x4094_encode_char(char ch, bool separator_on)
{
    uint8_t segments = 0x00;

    switch (ch) {
        case '0': segments = 0x3F; break;
        case '1': segments = 0x06; break;
        case '2': segments = 0x5B; break;
        case '3': segments = 0x4F; break;
        case '4': segments = 0x66; break;
        case '5': segments = 0x6D; break;
        case '6': segments = 0x7D; break;
        case '7': segments = 0x07; break;
        case '8': segments = 0x7F; break;
        case '9': segments = 0x6F; break;
        case '-': segments = 0x40; break;
        default: segments = 0x00; break;
    }

    if (separator_on) {
        segments |= 0x80;
    }
    return segments;
}

static uint8_t clock_4x4094_mirror_segments(uint8_t segments)
{
    uint8_t mirrored = segments & ((1U << 0) | (1U << 3) | (1U << 6) | (1U << 7));

    if (segments & (1U << 1)) {
        mirrored |= (1U << 5);
    }
    if (segments & (1U << 5)) {
        mirrored |= (1U << 1);
    }
    if (segments & (1U << 2)) {
        mirrored |= (1U << 4);
    }
    if (segments & (1U << 4)) {
        mirrored |= (1U << 2);
    }

    return mirrored;
}

static uint8_t clock_4x4094_remap_segments(uint8_t segments, const uint8_t segment_map[8])
{
    uint8_t remapped = 0x00;

    if (!segment_map) {
        return segments;
    }

    for (int logical = 0; logical < 8; ++logical) {
        uint8_t physical = segment_map[logical];
        if (physical > 7U) {
            physical = (uint8_t)logical;
        }
        if (segments & (1U << logical)) {
            remapped |= (uint8_t)(1U << physical);
        }
    }

    return remapped;
}

static void clock_4x4094_shift_byte_locked(output_runtime_t *out, uint8_t value)
{
    for (int bit = 7; bit >= 0; --bit) {
        (void)gpio_set_level((gpio_num_t)out->gpio, (value >> bit) & 0x01);
        (void)gpio_set_level((gpio_num_t)out->cfg.clock_4x4094.gpio_b, 1);
        esp_rom_delay_us(1);
        (void)gpio_set_level((gpio_num_t)out->cfg.clock_4x4094.gpio_b, 0);
    }
}

static void clock_4x4094_build_display_locked(output_runtime_t *out, int64_t now_us,
                                              char digits[4], char text[8],
                                              bool *time_valid, bool *separator_on)
{
    bool valid = clock_time_is_valid();
    bool separator = false;

    digits[0] = ' ';
    digits[1] = ' ';
    digits[2] = ' ';
    digits[3] = ' ';
    snprintf(text, 8, "%s", out->power ? "----" : "OFF");

    if (out->test_active) {
        digits[0] = '8';
        digits[1] = '8';
        digits[2] = '8';
        digits[3] = '8';
        separator = out->cfg.clock_4x4094.blink_separator;
        snprintf(text, 8, "88:88");
        *time_valid = valid;
        *separator_on = separator;
        return;
    }

    if (!out->power) {
        *time_valid = valid;
        *separator_on = false;
        return;
    }

    if (!valid) {
        digits[0] = '-';
        digits[1] = '-';
        digits[2] = '-';
        digits[3] = '-';
        snprintf(text, 8, "--:--");
        *time_valid = false;
        *separator_on = false;
        return;
    }

    time_t shifted = time(NULL) + ((time_t)out->cfg.clock_4x4094.timezone_offset_min * 60);
    struct tm tm_now = {0};
    gmtime_r(&shifted, &tm_now);

    digits[0] = (char)('0' + (tm_now.tm_hour / 10));
    digits[1] = (char)('0' + (tm_now.tm_hour % 10));
    digits[2] = (char)('0' + (tm_now.tm_min / 10));
    digits[3] = (char)('0' + (tm_now.tm_min % 10));
    if (!out->cfg.clock_4x4094.leading_zero && tm_now.tm_hour < 10) {
        digits[0] = ' ';
    }

    if (!out->cfg.clock_4x4094.blink_separator) {
        separator = true;
    } else {
        int64_t blink_period_us = (int64_t)out->cfg.clock_4x4094.blink_period_ms * 1000LL;
        int64_t half_period_us = blink_period_us / 2LL;
        if (half_period_us <= 0LL) {
            half_period_us = 1000000LL;
        }
        separator = ((now_us / half_period_us) % 2LL) == 0LL;
    }
    snprintf(text, 8, "%c%c:%c%c", digits[0], digits[1], digits[2], digits[3]);
    *time_valid = true;
    *separator_on = separator;
}

