klactrafob/esp32-c3_matter/src/core/modules.c
static esp_err_t clock_4x4094_apply_state_locked(output_runtime_t *out, int64_t now_us, bool force_render)
{
    char digits[4] = {' ', ' ', ' ', ' '};
    char text[8] = {0};
    bool time_valid = false;
    bool separator_on = false;
    uint8_t frame[4] = {0};
    bool frame_changed = false;
    bool status_changed = false;

    if (!out || out->type != OUTPUT_TYPE_CLOCK_4X4094) {
        return ESP_ERR_INVALID_ARG;
    }

    clock_4x4094_build_display_locked(out, now_us, digits, text, &time_valid, &separator_on);

    for (int i = 0; i < 4; ++i) {
        int src_index = out->cfg.clock_4x4094.reverse_digits ? (3 - i) : i;
        bool dot = separator_on && i == 2;
        frame[i] = clock_4x4094_encode_char(digits[src_index], dot);
        if (out->cfg.clock_4x4094.mirror_segments) {
            frame[i] = clock_4x4094_mirror_segments(frame[i]);
        }
        frame[i] = clock_4x4094_remap_segments(frame[i], out->cfg.clock_4x4094.segment_map);
        if (out->cfg.clock_4x4094.common_anode) {
            frame[i] = (uint8_t)~frame[i];
        }
        if (frame[i] != out->cfg.clock_4x4094.segments[i]) {
            frame_changed = true;
        }
    }

    status_changed = force_render ||
                     frame_changed ||
                     out->cfg.clock_4x4094.time_valid != time_valid ||
                     out->cfg.clock_4x4094.separator_on != separator_on ||
                     strcmp(out->cfg.clock_4x4094.display_text, text) != 0;

    if (frame_changed || force_render) {
        (void)gpio_set_level((gpio_num_t)out->cfg.clock_4x4094.gpio_c, 0);
        // Bytes are shifted from the furthest register to the nearest one.
        for (int i = 3; i >= 0; --i) {
            clock_4x4094_shift_byte_locked(out, frame[i]);
        }
        (void)gpio_set_level((gpio_num_t)out->cfg.clock_4x4094.gpio_c, 1);
        esp_rom_delay_us(1);
        (void)gpio_set_level((gpio_num_t)out->cfg.clock_4x4094.gpio_c, 0);
        memcpy(out->cfg.clock_4x4094.segments, frame, sizeof(frame));
    }

    out->cfg.clock_4x4094.time_valid = time_valid;
    out->cfg.clock_4x4094.separator_on = separator_on;
    snprintf(out->cfg.clock_4x4094.display_text, sizeof(out->cfg.clock_4x4094.display_text), "%s", text);
    if (time_valid && out->power) {
        time_t shifted = time(NULL) + ((time_t)out->cfg.clock_4x4094.timezone_offset_min * 60);
        struct tm tm_now = {0};
        gmtime_r(&shifted, &tm_now);
        out->cfg.clock_4x4094.display_hour = tm_now.tm_hour;
        out->cfg.clock_4x4094.display_minute = tm_now.tm_min;
    } else {
        out->cfg.clock_4x4094.display_hour = -1;
        out->cfg.clock_4x4094.display_minute = -1;
    }
    out->cfg.clock_4x4094.last_render_us = now_us;

    return status_changed ? ESP_OK : ESP_ERR_NO_MEM;
}

static bool update_clock_4x4094_locked(output_runtime_t *out, int64_t now_us)
{
    esp_err_t err = clock_4x4094_apply_state_locked(out, now_us, false);
    return err == ESP_OK;
}

static esp_err_t clock_4x4094_apply_brightness_locked(output_runtime_t *out)
{
    uint32_t duty = 0;
    const uint32_t max_duty = (1U << LEDC_TIMER_13_BIT) - 1U;
    int requested = 0;

    if (!out || out->type != OUTPUT_TYPE_CLOCK_4X4094) {
        return ESP_ERR_INVALID_ARG;
    }
    if (out->cfg.clock_4x4094.brightness_gpio < 0) {
        return ESP_OK;
    }

    requested = out->power ? out->cfg.clock_4x4094.level : 0;
    if (requested < 0) {
        requested = 0;
    }
    if (requested > 100) {
        requested = 100;
    }

    duty = (uint32_t)((requested * (int)max_duty) / 100);
    ESP_ERROR_CHECK(ledc_set_duty(LEDC_LOW_SPEED_MODE, out->cfg.clock_4x4094.channel, duty));
    return ledc_update_duty(LEDC_LOW_SPEED_MODE, out->cfg.clock_4x4094.channel);
}

static esp_err_t set_pwm_power_relay_locked(output_runtime_t *out, bool on)
{
    if (!out || out->type != OUTPUT_TYPE_PWM || out->cfg.pwm.power_relay_gpio < 0) {
        return ESP_OK;
    }

    int level = on ? out->cfg.pwm.power_relay_active_level : (1 - out->cfg.pwm.power_relay_active_level);
    return gpio_set_level(out->cfg.pwm.power_relay_gpio, level);
}

static esp_err_t ensure_adc_channel_locked(int gpio, adc_channel_t *out_channel)
{
    adc_unit_t unit = ADC_UNIT_1;
    adc_channel_t channel = ADC_CHANNEL_0;
    esp_err_t err;

    if (adc_oneshot_io_to_channel(gpio, &unit, &channel) != ESP_OK || unit != ADC_UNIT_1) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (!s_runtime.adc.handle) {
        adc_oneshot_unit_init_cfg_t init_cfg = {
            .unit_id = ADC_UNIT_1,
            .ulp_mode = ADC_ULP_MODE_DISABLE,
        };
        ESP_RETURN_ON_ERROR(adc_oneshot_new_unit(&init_cfg, &s_runtime.adc.handle),
                            TAG, "adc init failed");
        s_runtime.adc.active = true;
        s_runtime.adc.configured_mask = 0;
    }

    if ((s_runtime.adc.configured_mask & (1U << channel)) == 0U) {
        adc_oneshot_chan_cfg_t chan_cfg = {
            .atten = ADC_ATTEN_DB_12,
            .bitwidth = ADC_BITWIDTH_DEFAULT,
        };
        err = adc_oneshot_config_channel(s_runtime.adc.handle, channel, &chan_cfg);
        if (err != ESP_OK) {
            return err;
        }
        s_runtime.adc.configured_mask |= (1U << channel);
    }

    if (out_channel) {
        *out_channel = channel;
    }
    return ESP_OK;
}

static esp_err_t servo_5wire_set_drive_locked(output_runtime_t *out, int logical_direction)
{
    int drive = logical_direction;
    int level_a = 0;
    int level_b = 0;

    if (!out || out->type != OUTPUT_TYPE_SERVO_5WIRE) {
        return ESP_ERR_INVALID_ARG;
    }

    if (drive > 0) {
        drive = 1;
    } else if (drive < 0) {
        drive = -1;
    } else {
        drive = 0;
    }

    if (out->cfg.servo_5wire.reverse_direction) {
        drive = -drive;
    }

    if (drive > 0) {
        level_a = 1;
        level_b = 0;
    } else if (drive < 0) {
        level_a = 0;
        level_b = 1;
    }

    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->gpio, level_a), TAG, "servo a drive failed");
    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->cfg.servo_5wire.gpio_b, level_b), TAG, "servo b drive failed");
    out->cfg.servo_5wire.drive_state = logical_direction > 0 ? 1 : (logical_direction < 0 ? -1 : 0);
    return ESP_OK;
}

