klactrafob/esp32-c3_matter/src/core/modules.c
static int servo_5wire_feedback_to_level_locked(const output_runtime_t *out, int raw)
{
    int min_raw;
    int max_raw;
    int pct;

    if (!out || out->type != OUTPUT_TYPE_SERVO_5WIRE) {
        return 0;
    }

    min_raw = out->cfg.servo_5wire.feedback_min_raw;
    max_raw = out->cfg.servo_5wire.feedback_max_raw;
    if (min_raw == max_raw) {
        return 0;
    }

    if (min_raw < max_raw) {
        pct = (int)(((int64_t)(raw - min_raw) * 100LL) / (int64_t)(max_raw - min_raw));
    } else {
        pct = (int)(((int64_t)(min_raw - raw) * 100LL) / (int64_t)(min_raw - max_raw));
    }

    if (pct < 0) {
        pct = 0;
    }
    if (pct > 100) {
        pct = 100;
    }
    return pct;
}

static esp_err_t servo_5wire_read_feedback_locked(output_runtime_t *out, int *out_raw, int *out_level)
{
    int sum = 0;
    int raw = 0;

    if (!out || out->type != OUTPUT_TYPE_SERVO_5WIRE || !s_runtime.adc.handle) {
        return ESP_ERR_INVALID_STATE;
    }

    for (int i = 0; i < 4; ++i) {
        ESP_RETURN_ON_ERROR(adc_oneshot_read(s_runtime.adc.handle, out->cfg.servo_5wire.adc_channel, &raw),
                            TAG, "servo feedback read failed");
        sum += raw;
    }

    raw = sum / 4;
    out->cfg.servo_5wire.feedback_raw = raw;
    out->cfg.servo_5wire.current_level = servo_5wire_feedback_to_level_locked(out, raw);

    if (out_raw) {
        *out_raw = raw;
    }
    if (out_level) {
        *out_level = out->cfg.servo_5wire.current_level;
    }
    return ESP_OK;
}

static bool update_servo_3wire_release_locked(output_runtime_t *out, int64_t now_us)
{
    esp_err_t err;

    if (!out || out->type != OUTPUT_TYPE_SERVO_3WIRE || !out->enabled || !out->supported) {
        return false;
    }
    if (!out->power || out->test_active) {
        return false;
    }
    if (out->cfg.servo_3wire.hold_power_ms <= 0 || out->cfg.servo_3wire.release_at_us <= 0) {
        return false;
    }
    if (now_us < out->cfg.servo_3wire.release_at_us) {
        return false;
    }

    out->cfg.servo_3wire.release_at_us = 0;
    out->power = false;
    err = ledc_stop(LEDC_LOW_SPEED_MODE, out->cfg.servo_3wire.channel, 0);
    if (err != ESP_OK) {
        ESP_LOGW(TAG, "servo release failed for %s: %s", out->id, esp_err_to_name(err));
    }
    return true;
}

static bool update_servo_5wire_control_locked(output_runtime_t *out, int64_t now_us)
{
    int previous_level;
    bool previous_moving;
    bool previous_timeout;
    int current_level = 0;
    int error = 0;
    int direction = 0;
    bool changed = false;

    if (!out || out->type != OUTPUT_TYPE_SERVO_5WIRE || !out->enabled || !out->supported) {
        return false;
    }

    previous_level = out->cfg.servo_5wire.current_level;
    previous_moving = out->cfg.servo_5wire.moving;
    previous_timeout = out->cfg.servo_5wire.timed_out;

    if (servo_5wire_read_feedback_locked(out, NULL, &current_level) != ESP_OK) {
        (void)servo_5wire_set_drive_locked(out, 0);
        out->cfg.servo_5wire.moving = false;
        return previous_moving;
    }

    error = out->cfg.servo_5wire.target_level - current_level;
    if (error > out->cfg.servo_5wire.deadband_pct) {
        direction = 1;
    } else if (error < -out->cfg.servo_5wire.deadband_pct) {
        direction = -1;
    }

    if (direction == 0) {
        (void)servo_5wire_set_drive_locked(out, 0);
        out->cfg.servo_5wire.moving = false;
        out->cfg.servo_5wire.timed_out = false;
        out->cfg.servo_5wire.drive_started_us = 0;
    } else if (out->cfg.servo_5wire.timed_out) {
        (void)servo_5wire_set_drive_locked(out, 0);
        out->cfg.servo_5wire.moving = false;
    } else {
        if (!out->cfg.servo_5wire.moving || out->cfg.servo_5wire.drive_state != direction) {
            out->cfg.servo_5wire.drive_started_us = now_us;
            out->cfg.servo_5wire.timed_out = false;
        }

        if (out->cfg.servo_5wire.drive_started_us > 0 &&
            (now_us - out->cfg.servo_5wire.drive_started_us) >= ((int64_t)out->cfg.servo_5wire.move_timeout_ms * 1000LL)) {
            (void)servo_5wire_set_drive_locked(out, 0);
            out->cfg.servo_5wire.moving = false;
            out->cfg.servo_5wire.timed_out = true;
            out->cfg.servo_5wire.drive_started_us = 0;
        } else {
            (void)servo_5wire_set_drive_locked(out, direction);
            out->cfg.servo_5wire.moving = true;
            out->cfg.servo_5wire.timed_out = false;
        }
    }

    changed = previous_level != out->cfg.servo_5wire.current_level ||
              previous_moving != out->cfg.servo_5wire.moving ||
              previous_timeout != out->cfg.servo_5wire.timed_out;
    out->power = out->cfg.servo_5wire.moving;
    return changed;
}

static int stepper_level_to_position(int level, int steps_range)
{
    if (steps_range < 1) {
        steps_range = 1;
    }
    if (level < 0) {
        level = 0;
    }
    if (level > 100) {
        level = 100;
    }
    return (level * steps_range + 50) / 100;
}

static int stepper_position_to_level(int position_steps, int steps_range)
{
    if (steps_range < 1) {
        steps_range = 1;
    }
    if (position_steps < 0) {
        position_steps = 0;
    }
    if (position_steps > steps_range) {
        position_steps = steps_range;
    }
    return (position_steps * 100 + (steps_range / 2)) / steps_range;
}

static esp_err_t stepper_28byj_apply_phase_locked(output_runtime_t *out, int phase_index)
{
    static const uint8_t k_half_step[8][4] = {
        {1, 0, 0, 0},
        {1, 1, 0, 0},
        {0, 1, 0, 0},
        {0, 1, 1, 0},
        {0, 0, 1, 0},
        {0, 0, 1, 1},
        {0, 0, 0, 1},
        {1, 0, 0, 1},
    };

    if (!out || out->type != OUTPUT_TYPE_STEPPER_28BYJ) {
        return ESP_ERR_INVALID_ARG;
    }

    phase_index %= 8;
    if (phase_index < 0) {
        phase_index += 8;
    }

    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->gpio, k_half_step[phase_index][0]), TAG, "stepper 28byj phase a failed");
    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->cfg.stepper_28byj.gpio_b, k_half_step[phase_index][1]), TAG, "stepper 28byj phase b failed");
    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->cfg.stepper_28byj.gpio_c, k_half_step[phase_index][2]), TAG, "stepper 28byj phase c failed");
    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->cfg.stepper_28byj.gpio_d, k_half_step[phase_index][3]), TAG, "stepper 28byj phase d failed");
    out->cfg.stepper_28byj.phase_index = phase_index;
    return ESP_OK;
}

