klactrafob/esp32-c3_matter/src/core/modules.c
static esp_err_t stepper_28byj_release_locked(output_runtime_t *out)
{
    if (!out || out->type != OUTPUT_TYPE_STEPPER_28BYJ) {
        return ESP_ERR_INVALID_ARG;
    }

    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->gpio, 0), TAG, "stepper 28byj release a failed");
    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->cfg.stepper_28byj.gpio_b, 0), TAG, "stepper 28byj release b failed");
    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->cfg.stepper_28byj.gpio_c, 0), TAG, "stepper 28byj release c failed");
    return gpio_set_level((gpio_num_t)out->cfg.stepper_28byj.gpio_d, 0);
}

static bool stepper_28byj_home_active_locked(output_runtime_t *out)
{
    bool active = false;

    if (!out || out->type != OUTPUT_TYPE_STEPPER_28BYJ || out->cfg.stepper_28byj.home_gpio < 0) {
        return false;
    }

    active = gpio_get_level((gpio_num_t)out->cfg.stepper_28byj.home_gpio) != 0;
    if (out->cfg.stepper_28byj.home_inverted) {
        active = !active;
    }
    out->cfg.stepper_28byj.home_active = active;
    return active;
}

static void stepper_28byj_finish_home_locked(output_runtime_t *out)
{
    if (!out || out->type != OUTPUT_TYPE_STEPPER_28BYJ) {
        return;
    }

    out->cfg.stepper_28byj.current_position_steps = 0;
    out->cfg.stepper_28byj.target_position_steps = 0;
    out->cfg.stepper_28byj.current_level = 0;
    out->cfg.stepper_28byj.target_level = 0;
    out->cfg.stepper_28byj.last_step_us = 0;
    out->cfg.stepper_28byj.homing = false;
    out->cfg.stepper_28byj.homed = true;
    out->cfg.stepper_28byj.home_active = true;
    out->cfg.stepper_28byj.moving = false;

    if (out->cfg.stepper_28byj.hold_enabled) {
        (void)stepper_28byj_apply_phase_locked(out, out->cfg.stepper_28byj.phase_index);
        out->power = true;
    } else {
        (void)stepper_28byj_release_locked(out);
        out->power = false;
    }
}

static esp_err_t stepper_28byj_start_home_locked(output_runtime_t *out)
{
    if (!out || out->type != OUTPUT_TYPE_STEPPER_28BYJ) {
        return ESP_ERR_INVALID_ARG;
    }
    if (out->cfg.stepper_28byj.home_gpio < 0) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (stepper_28byj_home_active_locked(out)) {
        stepper_28byj_finish_home_locked(out);
        return ESP_OK;
    }

    out->cfg.stepper_28byj.homing = true;
    out->cfg.stepper_28byj.homed = false;
    out->cfg.stepper_28byj.target_position_steps = 0;
    out->cfg.stepper_28byj.target_level = 0;
    out->cfg.stepper_28byj.last_step_us = 0;
    out->cfg.stepper_28byj.moving = true;
    out->power = true;
    return ESP_OK;
}

static esp_err_t stepper_28byj_stop_locked(output_runtime_t *out)
{
    if (!out || out->type != OUTPUT_TYPE_STEPPER_28BYJ) {
        return ESP_ERR_INVALID_ARG;
    }

    out->cfg.stepper_28byj.homing = false;
    out->cfg.stepper_28byj.target_position_steps = out->cfg.stepper_28byj.current_position_steps;
    out->cfg.stepper_28byj.target_level = out->cfg.stepper_28byj.current_level;
    out->cfg.stepper_28byj.moving = false;
    out->cfg.stepper_28byj.last_step_us = 0;
    out->power = out->cfg.stepper_28byj.hold_enabled;
    if (!out->cfg.stepper_28byj.hold_enabled) {
        return stepper_28byj_release_locked(out);
    }
    return stepper_28byj_apply_phase_locked(out, out->cfg.stepper_28byj.phase_index);
}

static esp_err_t stepper_a4988_set_enable_locked(output_runtime_t *out, bool enabled)
{
    if (!out || out->type != OUTPUT_TYPE_STEPPER_A4988) {
        return ESP_ERR_INVALID_ARG;
    }
    if (out->cfg.stepper_a4988.gpio_c < 0) {
        return ESP_OK;
    }
    return gpio_set_level((gpio_num_t)out->cfg.stepper_a4988.gpio_c,
                          enabled ? out->cfg.stepper_a4988.enable_active_level
                                  : (1 - out->cfg.stepper_a4988.enable_active_level));
}

static esp_err_t stepper_a4988_step_locked(output_runtime_t *out, int logical_direction)
{
    int dir_level;

    if (!out || out->type != OUTPUT_TYPE_STEPPER_A4988 || logical_direction == 0) {
        return ESP_ERR_INVALID_ARG;
    }

    dir_level = logical_direction > 0 ? 1 : 0;
    if (out->cfg.stepper_a4988.reverse_direction) {
        dir_level = 1 - dir_level;
    }

    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->cfg.stepper_a4988.gpio_b, dir_level), TAG, "stepper a4988 dir failed");
    ESP_RETURN_ON_ERROR(stepper_a4988_set_enable_locked(out, true), TAG, "stepper a4988 enable failed");
    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->gpio, 1), TAG, "stepper a4988 step high failed");
    esp_rom_delay_us((uint32_t)out->cfg.stepper_a4988.step_pulse_us);
    ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->gpio, 0), TAG, "stepper a4988 step low failed");
    esp_rom_delay_us((uint32_t)out->cfg.stepper_a4988.step_pulse_us);
    return ESP_OK;
}

static bool stepper_a4988_home_active_locked(output_runtime_t *out)
{
    bool active = false;

    if (!out || out->type != OUTPUT_TYPE_STEPPER_A4988 || out->cfg.stepper_a4988.home_gpio < 0) {
        return false;
    }

    active = gpio_get_level((gpio_num_t)out->cfg.stepper_a4988.home_gpio) != 0;
    if (out->cfg.stepper_a4988.home_inverted) {
        active = !active;
    }
    out->cfg.stepper_a4988.home_active = active;
    return active;
}

static void stepper_a4988_finish_home_locked(output_runtime_t *out)
{
    if (!out || out->type != OUTPUT_TYPE_STEPPER_A4988) {
        return;
    }

    out->cfg.stepper_a4988.current_position_steps = 0;
    out->cfg.stepper_a4988.target_position_steps = 0;
    out->cfg.stepper_a4988.current_level = 0;
    out->cfg.stepper_a4988.target_level = 0;
    out->cfg.stepper_a4988.last_step_us = 0;
    out->cfg.stepper_a4988.homing = false;
    out->cfg.stepper_a4988.homed = true;
    out->cfg.stepper_a4988.home_active = true;
    out->cfg.stepper_a4988.moving = false;

    if (out->cfg.stepper_a4988.hold_enabled) {
        (void)stepper_a4988_set_enable_locked(out, true);
        out->power = true;
    } else {
        (void)stepper_a4988_set_enable_locked(out, false);
        out->power = false;
    }
}

static esp_err_t stepper_a4988_start_home_locked(output_runtime_t *out)
{
    if (!out || out->type != OUTPUT_TYPE_STEPPER_A4988) {
        return ESP_ERR_INVALID_ARG;
    }
    if (out->cfg.stepper_a4988.home_gpio < 0) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (stepper_a4988_home_active_locked(out)) {
        stepper_a4988_finish_home_locked(out);
        return ESP_OK;
    }

