klactrafob/esp32-c3_matter/src/core/modules.c
    out->cfg.stepper_a4988.homing = true;
    out->cfg.stepper_a4988.homed = false;
    out->cfg.stepper_a4988.target_position_steps = 0;
    out->cfg.stepper_a4988.target_level = 0;
    out->cfg.stepper_a4988.last_step_us = 0;
    out->cfg.stepper_a4988.moving = true;
    out->power = true;
    return ESP_OK;
}

static esp_err_t stepper_a4988_stop_locked(output_runtime_t *out)
{
    if (!out || out->type != OUTPUT_TYPE_STEPPER_A4988) {
        return ESP_ERR_INVALID_ARG;
    }

    out->cfg.stepper_a4988.homing = false;
    out->cfg.stepper_a4988.target_position_steps = out->cfg.stepper_a4988.current_position_steps;
    out->cfg.stepper_a4988.target_level = out->cfg.stepper_a4988.current_level;
    out->cfg.stepper_a4988.moving = false;
    out->cfg.stepper_a4988.last_step_us = 0;
    out->power = out->cfg.stepper_a4988.hold_enabled;
    return stepper_a4988_set_enable_locked(out, out->cfg.stepper_a4988.hold_enabled);
}

static bool update_stepper_28byj_control_locked(output_runtime_t *out, int64_t now_us)
{
    bool changed = false;
    bool previous_home_active;
    bool previous_homing;
    bool previous_homed;
    bool previous_moving;
    int speed;
    int64_t step_interval_us;
    int steps_due = 0;

    if (!out || out->type != OUTPUT_TYPE_STEPPER_28BYJ || !out->enabled || !out->supported) {
        return false;
    }

    previous_home_active = out->cfg.stepper_28byj.home_active;
    previous_homing = out->cfg.stepper_28byj.homing;
    previous_homed = out->cfg.stepper_28byj.homed;
    previous_moving = out->cfg.stepper_28byj.moving;

    if (out->cfg.stepper_28byj.home_gpio >= 0 && stepper_28byj_home_active_locked(out)) {
        if (out->cfg.stepper_28byj.homing ||
            (out->cfg.stepper_28byj.current_position_steps > 0 &&
             out->cfg.stepper_28byj.target_position_steps <= out->cfg.stepper_28byj.current_position_steps)) {
            stepper_28byj_finish_home_locked(out);
        } else {
            out->cfg.stepper_28byj.homed = true;
        }
    }

    speed = out->cfg.stepper_28byj.speed_steps_per_sec;
    if (speed < 1) {
        speed = 1;
    }
    step_interval_us = 1000000LL / speed;
    if (step_interval_us < 1000LL) {
        step_interval_us = 1000LL;
    }

    if (out->cfg.stepper_28byj.current_position_steps != out->cfg.stepper_28byj.target_position_steps) {
        if (out->cfg.stepper_28byj.last_step_us <= 0) {
            out->cfg.stepper_28byj.last_step_us = now_us - step_interval_us;
        }
        if (now_us >= out->cfg.stepper_28byj.last_step_us + step_interval_us) {
            steps_due = (int)((now_us - out->cfg.stepper_28byj.last_step_us) / step_interval_us);
            if (steps_due < 1) {
                steps_due = 1;
            }
            if (steps_due > 64) {
                steps_due = 64;
            }
        }
    }

    while (steps_due-- > 0 &&
           out->cfg.stepper_28byj.current_position_steps != out->cfg.stepper_28byj.target_position_steps) {
        int logical_direction = (out->cfg.stepper_28byj.target_position_steps > out->cfg.stepper_28byj.current_position_steps) ? 1 : -1;
        int phase_delta = out->cfg.stepper_28byj.reverse_direction ? -logical_direction : logical_direction;
        int next_phase = out->cfg.stepper_28byj.phase_index + phase_delta;

        if (out->cfg.stepper_28byj.home_gpio >= 0 && logical_direction < 0 && stepper_28byj_home_active_locked(out)) {
            stepper_28byj_finish_home_locked(out);
            changed = true;
            break;
        }

        if (stepper_28byj_apply_phase_locked(out, next_phase) != ESP_OK) {
            break;
        }

        out->cfg.stepper_28byj.current_position_steps += logical_direction;
        if (out->cfg.stepper_28byj.current_position_steps < 0) {
            out->cfg.stepper_28byj.current_position_steps = 0;
        }
        if (out->cfg.stepper_28byj.current_position_steps > out->cfg.stepper_28byj.steps_range) {
            out->cfg.stepper_28byj.current_position_steps = out->cfg.stepper_28byj.steps_range;
        }
        out->cfg.stepper_28byj.current_level =
            stepper_position_to_level(out->cfg.stepper_28byj.current_position_steps, out->cfg.stepper_28byj.steps_range);
        out->cfg.stepper_28byj.last_step_us += step_interval_us;
        changed = true;

        if (out->cfg.stepper_28byj.home_gpio >= 0 && logical_direction < 0 && stepper_28byj_home_active_locked(out)) {
            stepper_28byj_finish_home_locked(out);
            break;
        }
    }

    out->cfg.stepper_28byj.moving =
        out->cfg.stepper_28byj.current_position_steps != out->cfg.stepper_28byj.target_position_steps;

    if (!out->cfg.stepper_28byj.moving) {
        if (out->cfg.stepper_28byj.hold_enabled) {
            (void)stepper_28byj_apply_phase_locked(out, out->cfg.stepper_28byj.phase_index);
            out->power = true;
        } else {
            (void)stepper_28byj_release_locked(out);
            out->power = false;
        }
    } else {
        out->power = true;
    }

    changed = changed ||
              previous_home_active != out->cfg.stepper_28byj.home_active ||
              previous_homing != out->cfg.stepper_28byj.homing ||
              previous_homed != out->cfg.stepper_28byj.homed ||
              previous_moving != out->cfg.stepper_28byj.moving;

    return changed;
}

static bool update_stepper_a4988_control_locked(output_runtime_t *out, int64_t now_us)
{
    bool changed = false;
    bool previous_home_active;
    bool previous_homing;
    bool previous_homed;
    bool previous_moving;
    int speed;
    int64_t step_interval_us;
    int steps_due = 0;

    if (!out || out->type != OUTPUT_TYPE_STEPPER_A4988 || !out->enabled || !out->supported) {
        return false;
    }

    previous_home_active = out->cfg.stepper_a4988.home_active;
    previous_homing = out->cfg.stepper_a4988.homing;
    previous_homed = out->cfg.stepper_a4988.homed;
    previous_moving = out->cfg.stepper_a4988.moving;

    if (out->cfg.stepper_a4988.home_gpio >= 0 && stepper_a4988_home_active_locked(out)) {
        if (out->cfg.stepper_a4988.homing ||
            (out->cfg.stepper_a4988.current_position_steps > 0 &&
             out->cfg.stepper_a4988.target_position_steps <= out->cfg.stepper_a4988.current_position_steps)) {
            stepper_a4988_finish_home_locked(out);
        } else {
            out->cfg.stepper_a4988.homed = true;
        }
    }

    speed = out->cfg.stepper_a4988.speed_steps_per_sec;
    if (speed < 1) {
        speed = 1;
    }
    step_interval_us = 1000000LL / speed;
    if (step_interval_us < 1000LL) {
        step_interval_us = 1000LL;
    }

    if (out->cfg.stepper_a4988.current_position_steps != out->cfg.stepper_a4988.target_position_steps) {
        if (out->cfg.stepper_a4988.last_step_us <= 0) {
            out->cfg.stepper_a4988.last_step_us = now_us - step_interval_us;
        }
        if (now_us >= out->cfg.stepper_a4988.last_step_us + step_interval_us) {
            steps_due = (int)((now_us - out->cfg.stepper_a4988.last_step_us) / step_interval_us);
            if (steps_due < 1) {
                steps_due = 1;
            }
            if (steps_due > 64) {
                steps_due = 64;
            }
        }
    }

