klactrafob/esp32-c3_matter/src/core/modules.c
    while (steps_due-- > 0 &&
           out->cfg.stepper_a4988.current_position_steps != out->cfg.stepper_a4988.target_position_steps) {
        int logical_direction = (out->cfg.stepper_a4988.target_position_steps > out->cfg.stepper_a4988.current_position_steps) ? 1 : -1;

        if (out->cfg.stepper_a4988.home_gpio >= 0 && logical_direction < 0 && stepper_a4988_home_active_locked(out)) {
            stepper_a4988_finish_home_locked(out);
            changed = true;
            break;
        }

        if (stepper_a4988_step_locked(out, logical_direction) != ESP_OK) {
            break;
        }

        out->cfg.stepper_a4988.current_position_steps += logical_direction;
        if (out->cfg.stepper_a4988.current_position_steps < 0) {
            out->cfg.stepper_a4988.current_position_steps = 0;
        }
        if (out->cfg.stepper_a4988.current_position_steps > out->cfg.stepper_a4988.steps_range) {
            out->cfg.stepper_a4988.current_position_steps = out->cfg.stepper_a4988.steps_range;
        }
        out->cfg.stepper_a4988.current_level =
            stepper_position_to_level(out->cfg.stepper_a4988.current_position_steps, out->cfg.stepper_a4988.steps_range);
        out->cfg.stepper_a4988.last_step_us += step_interval_us;
        changed = true;

        if (out->cfg.stepper_a4988.home_gpio >= 0 && logical_direction < 0 && stepper_a4988_home_active_locked(out)) {
            stepper_a4988_finish_home_locked(out);
            break;
        }
    }

    out->cfg.stepper_a4988.moving =
        out->cfg.stepper_a4988.current_position_steps != out->cfg.stepper_a4988.target_position_steps;

    if (!out->cfg.stepper_a4988.moving) {
        if (out->cfg.stepper_a4988.hold_enabled) {
            (void)stepper_a4988_set_enable_locked(out, true);
            out->power = true;
        } else {
            (void)stepper_a4988_set_enable_locked(out, false);
            out->power = false;
        }
    } else {
        out->power = true;
    }

    changed = changed ||
              previous_home_active != out->cfg.stepper_a4988.home_active ||
              previous_homing != out->cfg.stepper_a4988.homing ||
              previous_homed != out->cfg.stepper_a4988.homed ||
              previous_moving != out->cfg.stepper_a4988.moving;

    return changed;
}

static bool ws2812_color_order_valid(const char *order)
{
    static const char *const k_valid_orders[] = {
        "RGB", "RBG", "GRB", "GBR", "BRG", "BGR",
    };

    if (!order || order[0] == 0) {
        return false;
    }

    for (size_t i = 0; i < sizeof(k_valid_orders) / sizeof(k_valid_orders[0]); ++i) {
        if (strcmp(order, k_valid_orders[i]) == 0) {
            return true;
        }
    }

    return false;
}

static uint8_t ws2812_channel_value(char channel, uint8_t red, uint8_t green, uint8_t blue)
{
    switch (channel) {
        case 'R': return red;
        case 'G': return green;
        case 'B': return blue;
        default: return 0;
    }
}

static int clamp_level_pct(int level)
{
    if (level < 0) {
        return 0;
    }
    if (level > LEVEL_PCT_MAX) {
        return LEVEL_PCT_MAX;
    }
    return level;
}

static int clamp_ws2812_brightness(int brightness)
{
    if (brightness < 0) {
        return 0;
    }
    if (brightness > WS2812_BRIGHTNESS_MAX) {
        return WS2812_BRIGHTNESS_MAX;
    }
    return brightness;
}

static int ws2812_brightness_from_percent(int level_pct)
{
    int clamped = clamp_level_pct(level_pct);
    return (clamped * WS2812_BRIGHTNESS_MAX + (LEVEL_PCT_MAX / 2)) / LEVEL_PCT_MAX;
}

static int ws2812_percent_from_brightness(int brightness)
{
    int clamped = clamp_ws2812_brightness(brightness);
    return (clamped * LEVEL_PCT_MAX + (WS2812_BRIGHTNESS_MAX / 2)) / WS2812_BRIGHTNESS_MAX;
}

static uint8_t ws2812_apply_gamma(uint8_t value)
{
    static const uint8_t k_gamma_lut[256] = {
          0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   1,
          1,   1,   1,   1,   1,   1,   1,   1,   1,   2,   2,   2,   2,   2,   2,   2,
          3,   3,   3,   3,   3,   4,   4,   4,   4,   5,   5,   5,   5,   6,   6,   6,
          6,   7,   7,   7,   8,   8,   8,   9,   9,   9,  10,  10,  11,  11,  11,  12,
         12,  13,  13,  13,  14,  14,  15,  15,  16,  16,  17,  17,  18,  18,  19,  19,
         20,  20,  21,  22,  22,  23,  23,  24,  25,  25,  26,  26,  27,  28,  28,  29,
         30,  30,  31,  32,  33,  33,  34,  35,  35,  36,  37,  38,  39,  39,  40,  41,
         42,  43,  43,  44,  45,  46,  47,  48,  49,  49,  50,  51,  52,  53,  54,  55,
         56,  57,  58,  59,  60,  61,  62,  63,  64,  65,  66,  67,  68,  69,  70,  71,
         73,  74,  75,  76,  77,  78,  79,  81,  82,  83,  84,  85,  87,  88,  89,  90,
         91,  93,  94,  95,  97,  98,  99, 100, 102, 103, 105, 106, 107, 109, 110, 111,
        113, 114, 116, 117, 119, 120, 121, 123, 124, 126, 127, 129, 130, 132, 133, 135,
        137, 138, 140, 141, 143, 145, 146, 148, 149, 151, 153, 154, 156, 158, 159, 161,
        163, 165, 166, 168, 170, 172, 173, 175, 177, 179, 181, 182, 184, 186, 188, 190,
        192, 194, 196, 197, 199, 201, 203, 205, 207, 209, 211, 213, 215, 217, 219, 221,
        223, 225, 227, 229, 231, 234, 236, 238, 240, 242, 244, 246, 248, 251, 253, 255,
    };

    return k_gamma_lut[value];
}

static esp_err_t ws2812_set_pixel_ordered(output_runtime_t *out, int index, uint8_t red, uint8_t green, uint8_t blue)
{
    const char *order = ws2812_color_order_valid(out->cfg.ws2812.color_order) ? out->cfg.ws2812.color_order : "GRB";
    if (out->cfg.ws2812.gamma_correction) {
        red = ws2812_apply_gamma(red);
        green = ws2812_apply_gamma(green);
        blue = ws2812_apply_gamma(blue);
    }
    uint8_t wire_0 = ws2812_channel_value(order[0], red, green, blue);
    uint8_t wire_1 = ws2812_channel_value(order[1], red, green, blue);
    uint8_t wire_2 = ws2812_channel_value(order[2], red, green, blue);

    return led_strip_set_pixel(out->cfg.ws2812.strip, (uint32_t)index, wire_1, wire_0, wire_2);
}

static esp_err_t render_ws2812_frame_locked(output_runtime_t *out, int level, uint8_t red, uint8_t green, uint8_t blue, int wipe_active_segments)
{
    if (!out || out->type != OUTPUT_TYPE_WS2812 || !out->cfg.ws2812.strip) {
        return ESP_ERR_INVALID_STATE;
    }

    level = clamp_ws2812_brightness(level);

    if (level <= 0) {
        ESP_ERROR_CHECK(led_strip_clear(out->cfg.ws2812.strip));
        return ESP_OK;
    }

