klactrafob/esp32-c3_matter/src/core/modules.c
    if (out->cfg.ws2812.mode == WS2812_MODE_MONO_TRIPLET) {
        int total_segments = out->cfg.ws2812.pixel_count * 3;
        int active_segments = wipe_active_segments;
        uint8_t mono = (uint8_t)level;
        const char *order = ws2812_color_order_valid(out->cfg.ws2812.color_order) ? out->cfg.ws2812.color_order : "GRB";

        if (active_segments < 0 || active_segments > total_segments) {
            active_segments = total_segments;
        }

        for (int pixel = 0; pixel < out->cfg.ws2812.pixel_count; ++pixel) {
            uint8_t pixel_r = 0;
            uint8_t pixel_g = 0;
            uint8_t pixel_b = 0;

            for (int slot = 0; slot < 3; ++slot) {
                int seg_index = (pixel * 3) + slot;
                uint8_t channel_level = (seg_index < active_segments) ? mono : 0;
                switch (order[slot]) {
                    case 'R':
                        pixel_r = channel_level;
                        break;
                    case 'G':
                        pixel_g = channel_level;
                        break;
                    case 'B':
                        pixel_b = channel_level;
                        break;
                    default:
                        break;
                }
            }

            ESP_ERROR_CHECK(ws2812_set_pixel_ordered(out, pixel, pixel_r, pixel_g, pixel_b));
        }
    } else {
        uint8_t scaled_r = (uint8_t)(((uint32_t)red * (uint32_t)level) / WS2812_BRIGHTNESS_MAX);
        uint8_t scaled_g = (uint8_t)(((uint32_t)green * (uint32_t)level) / WS2812_BRIGHTNESS_MAX);
        uint8_t scaled_b = (uint8_t)(((uint32_t)blue * (uint32_t)level) / WS2812_BRIGHTNESS_MAX);

        for (int i = 0; i < out->cfg.ws2812.pixel_count; ++i) {
            ESP_ERROR_CHECK(ws2812_set_pixel_ordered(out, i, scaled_r, scaled_g, scaled_b));
        }
    }

    return led_strip_refresh(out->cfg.ws2812.strip);
}

static esp_err_t apply_ws2812_target_locked(output_runtime_t *out, bool allow_transition)
{
    int target_level;
    bool wants_wipe = false;

    if (!out || out->type != OUTPUT_TYPE_WS2812) {
        return ESP_ERR_INVALID_ARG;
    }

    target_level = out->power ? out->cfg.ws2812.level : 0;
    wants_wipe = (out->cfg.ws2812.mode == WS2812_MODE_MONO_TRIPLET) &&
                 (out->cfg.ws2812.transition_style == WS2812_TRANSITION_WIPE) &&
                 ((out->cfg.ws2812.applied_level == 0 && target_level > 0) ||
                  (out->cfg.ws2812.applied_level > 0 && target_level == 0));

    if (out->cfg.ws2812.applied_level == target_level &&
        out->cfg.ws2812.applied_red == out->cfg.ws2812.red &&
        out->cfg.ws2812.applied_green == out->cfg.ws2812.green &&
        out->cfg.ws2812.applied_blue == out->cfg.ws2812.blue) {
        out->cfg.ws2812.transition_active = false;
        out->cfg.ws2812.transition_use_wipe = false;
        return render_ws2812_frame_locked(out, out->cfg.ws2812.applied_level,
                                          out->cfg.ws2812.applied_red,
                                          out->cfg.ws2812.applied_green,
                                          out->cfg.ws2812.applied_blue, -1);
    }

    if (!allow_transition || out->cfg.ws2812.transition_style == WS2812_TRANSITION_NONE ||
        out->cfg.ws2812.transition_ms <= 0) {
        out->cfg.ws2812.transition_active = false;
        out->cfg.ws2812.transition_use_wipe = false;
        out->cfg.ws2812.applied_level = target_level;
        out->cfg.ws2812.applied_red = out->cfg.ws2812.red;
        out->cfg.ws2812.applied_green = out->cfg.ws2812.green;
        out->cfg.ws2812.applied_blue = out->cfg.ws2812.blue;
        return render_ws2812_frame_locked(out, out->cfg.ws2812.applied_level,
                                          out->cfg.ws2812.applied_red,
                                          out->cfg.ws2812.applied_green,
                                          out->cfg.ws2812.applied_blue, -1);
    }

    out->cfg.ws2812.transition_active = true;
    out->cfg.ws2812.transition_use_wipe = wants_wipe;
    out->cfg.ws2812.transition_started_us = esp_timer_get_time();
    out->cfg.ws2812.transition_duration_us = (int64_t)out->cfg.ws2812.transition_ms * 1000LL;
    out->cfg.ws2812.start_level = out->cfg.ws2812.applied_level;
    out->cfg.ws2812.target_level = target_level;
    out->cfg.ws2812.start_red = out->cfg.ws2812.applied_red;
    out->cfg.ws2812.start_green = out->cfg.ws2812.applied_green;
    out->cfg.ws2812.start_blue = out->cfg.ws2812.applied_blue;
    out->cfg.ws2812.target_red = out->cfg.ws2812.red;
    out->cfg.ws2812.target_green = out->cfg.ws2812.green;
    out->cfg.ws2812.target_blue = out->cfg.ws2812.blue;
    return ESP_OK;
}

static void update_ws2812_transitions_locked(int64_t now_us)
{
    for (int i = 0; i < s_runtime.output_count; ++i) {
        output_runtime_t *out = &s_runtime.outputs[i];
        int64_t elapsed_us;
        int level;
        uint8_t red;
        uint8_t green;
        uint8_t blue;

        if (!out->used || !out->enabled || out->type != OUTPUT_TYPE_WS2812 || !out->cfg.ws2812.transition_active) {
            continue;
        }

        elapsed_us = now_us - out->cfg.ws2812.transition_started_us;
        if (elapsed_us < 0) {
            elapsed_us = 0;
        }

        if (elapsed_us >= out->cfg.ws2812.transition_duration_us) {
            out->cfg.ws2812.transition_active = false;
            out->cfg.ws2812.transition_use_wipe = false;
            out->cfg.ws2812.applied_level = out->cfg.ws2812.target_level;
            out->cfg.ws2812.applied_red = out->cfg.ws2812.target_red;
            out->cfg.ws2812.applied_green = out->cfg.ws2812.target_green;
            out->cfg.ws2812.applied_blue = out->cfg.ws2812.target_blue;
            (void)render_ws2812_frame_locked(out, out->cfg.ws2812.applied_level,
                                             out->cfg.ws2812.applied_red,
                                             out->cfg.ws2812.applied_green,
                                             out->cfg.ws2812.applied_blue, -1);
            continue;
        }

