klactrafob/esp32-c3_matter/src/core/modules.c
        if (out->cfg.ws2812.transition_use_wipe) {
            int total_segments = out->cfg.ws2812.pixel_count * 3;
            int active_segments;
            bool turning_on = (out->cfg.ws2812.start_level == 0 && out->cfg.ws2812.target_level > 0);

            if (turning_on) {
                active_segments = (int)((elapsed_us * total_segments + out->cfg.ws2812.transition_duration_us - 1) /
                                        out->cfg.ws2812.transition_duration_us);
            } else {
                active_segments = total_segments -
                                  (int)((elapsed_us * total_segments + out->cfg.ws2812.transition_duration_us - 1) /
                                        out->cfg.ws2812.transition_duration_us);
            }

            if (active_segments < 0) {
                active_segments = 0;
            }
            if (active_segments > total_segments) {
                active_segments = total_segments;
            }

            out->cfg.ws2812.applied_level = turning_on ? out->cfg.ws2812.target_level : out->cfg.ws2812.start_level;
            out->cfg.ws2812.applied_red = out->cfg.ws2812.target_red;
            out->cfg.ws2812.applied_green = out->cfg.ws2812.target_green;
            out->cfg.ws2812.applied_blue = out->cfg.ws2812.target_blue;
            (void)render_ws2812_frame_locked(out, out->cfg.ws2812.applied_level,
                                             out->cfg.ws2812.applied_red,
                                             out->cfg.ws2812.applied_green,
                                             out->cfg.ws2812.applied_blue,
                                             active_segments);
            continue;
        }

        level = out->cfg.ws2812.start_level +
                (int)(((int64_t)(out->cfg.ws2812.target_level - out->cfg.ws2812.start_level) * elapsed_us) /
                      out->cfg.ws2812.transition_duration_us);
        red = (uint8_t)(out->cfg.ws2812.start_red +
                        (int)(((int64_t)(out->cfg.ws2812.target_red - out->cfg.ws2812.start_red) * elapsed_us) /
                              out->cfg.ws2812.transition_duration_us));
        green = (uint8_t)(out->cfg.ws2812.start_green +
                          (int)(((int64_t)(out->cfg.ws2812.target_green - out->cfg.ws2812.start_green) * elapsed_us) /
                                out->cfg.ws2812.transition_duration_us));
        blue = (uint8_t)(out->cfg.ws2812.start_blue +
                         (int)(((int64_t)(out->cfg.ws2812.target_blue - out->cfg.ws2812.start_blue) * elapsed_us) /
                               out->cfg.ws2812.transition_duration_us));

        out->cfg.ws2812.applied_level = level;
        out->cfg.ws2812.applied_red = red;
        out->cfg.ws2812.applied_green = green;
        out->cfg.ws2812.applied_blue = blue;
        (void)render_ws2812_frame_locked(out, level, red, green, blue, -1);
    }
}

static output_runtime_t *find_output_locked(const char *id)
{
    if (!id || !id[0]) {
        return NULL;
    }
    for (int i = 0; i < s_runtime.output_count; ++i) {
        if (s_runtime.outputs[i].used && strcmp(s_runtime.outputs[i].id, id) == 0) {
            return &s_runtime.outputs[i];
        }
    }
    return NULL;
}

static input_runtime_t *find_input_locked(const char *id)
{
    if (!id || !id[0]) {
        return NULL;
    }
    for (int i = 0; i < s_runtime.input_count; ++i) {
        if (s_runtime.inputs[i].used && strcmp(s_runtime.inputs[i].id, id) == 0) {
            return &s_runtime.inputs[i];
        }
    }
    return NULL;
}

static esp_err_t output_apply_physical_state(output_runtime_t *out)
{
    if (!out || !out->enabled) {
        return ESP_ERR_INVALID_STATE;
    }

    switch (out->type) {
        case OUTPUT_TYPE_RELAY: {
            int level = out->power ? out->cfg.relay.active_level : (1 - out->cfg.relay.active_level);
            return gpio_set_level(out->gpio, level);
        }
        case OUTPUT_TYPE_PWM: {
            int level = out->cfg.pwm.level;
            uint32_t duty = 0;
            const uint32_t max_duty = (1U << LEDC_TIMER_13_BIT) - 1U;
            int requested = out->power ? level : 0;
            int limited = 0;
            bool supply_on = false;

            if (requested < 0) {
                requested = 0;
            }
            if (requested > 100) {
                requested = 100;
            }

            limited = (requested * out->cfg.pwm.max_level_pct) / 100;
            if (limited < 0) {
                limited = 0;
            }
            if (limited > 100) {
                limited = 100;
            }

            supply_on = out->power && requested > 0;
            if (supply_on) {
                esp_err_t err = set_pwm_power_relay_locked(out, true);
                if (err != ESP_OK) {
                    return err;
                }
            }

            if (out->cfg.pwm.inverted) {
                limited = 100 - limited;
            }
            duty = (uint32_t)((limited * (int)max_duty) / 100);
            ESP_ERROR_CHECK(ledc_set_duty(LEDC_LOW_SPEED_MODE, out->cfg.pwm.channel, duty));
            esp_err_t err = ledc_update_duty(LEDC_LOW_SPEED_MODE, out->cfg.pwm.channel);
            if (err != ESP_OK) {
                return err;
            }

            if (!supply_on) {
                err = set_pwm_power_relay_locked(out, false);
                if (err != ESP_OK) {
                    return err;
                }
            }
            return ESP_OK;
        }
        case OUTPUT_TYPE_WS2812:
            return apply_ws2812_target_locked(out, true);
        case OUTPUT_TYPE_SERVO_3WIRE: {
            int level = out->cfg.servo_3wire.level;
            int pulse_us;
            uint32_t duty;
            const uint32_t max_duty = (1U << LEDC_TIMER_13_BIT) - 1U;

            if (!out->power) {
                out->cfg.servo_3wire.release_at_us = 0;
                return ledc_stop(LEDC_LOW_SPEED_MODE, out->cfg.servo_3wire.channel, 0);
            }
            if (level < 0) {
                level = 0;
            }
            if (level > 100) {
                level = 100;
            }
            if (out->cfg.servo_3wire.reverse_direction) {
                level = 100 - level;
            }

