klactrafob/esp32-c3_matter/src/core/modules.c
            pulse_us = out->cfg.servo_3wire.min_us +
                       (int)(((int64_t)(out->cfg.servo_3wire.max_us - out->cfg.servo_3wire.min_us) * level) / 100LL);
            duty = (uint32_t)(((int64_t)pulse_us * (int64_t)max_duty) / 20000LL);
            ESP_RETURN_ON_ERROR(ledc_set_duty(LEDC_LOW_SPEED_MODE, out->cfg.servo_3wire.channel, duty),
                                TAG, "servo duty set failed for %s", out->id);
            ESP_RETURN_ON_ERROR(ledc_update_duty(LEDC_LOW_SPEED_MODE, out->cfg.servo_3wire.channel),
                                TAG, "servo duty update failed for %s", out->id);
            if (out->cfg.servo_3wire.hold_power_ms > 0) {
                out->cfg.servo_3wire.release_at_us =
                    esp_timer_get_time() + ((int64_t)out->cfg.servo_3wire.hold_power_ms * 1000LL);
            } else {
                out->cfg.servo_3wire.release_at_us = 0;
            }
            return ESP_OK;
        }
        case OUTPUT_TYPE_SERVO_5WIRE:
            return servo_5wire_set_drive_locked(out, 0);
        case OUTPUT_TYPE_CLOCK_4X4094: {
            esp_err_t brightness_err = clock_4x4094_apply_brightness_locked(out);
            esp_err_t err = clock_4x4094_apply_state_locked(out, esp_timer_get_time(), true);
            if (brightness_err != ESP_OK) {
                return brightness_err;
            }
            return (err == ESP_ERR_NO_MEM) ? ESP_OK : err;
        }
        default:
            return ESP_ERR_INVALID_ARG;
    }
}

static esp_err_t set_output_power_locked(output_runtime_t *out, bool on)
{
    if (!out || !out->enabled) {
        return ESP_ERR_INVALID_STATE;
    }
    if (!output_supports_power_control(out)) {
        return ESP_ERR_INVALID_ARG;
    }
    out->power = on;
    return output_apply_physical_state(out);
}

static esp_err_t set_output_level_locked(output_runtime_t *out, int level)
{
    if (!out || !out->enabled) {
        return ESP_ERR_INVALID_STATE;
    }
    level = clamp_level_pct(level);

    if (out->type == OUTPUT_TYPE_PWM) {
        out->cfg.pwm.level = level;
        out->power = (level > 0);
    } else if (out->type == OUTPUT_TYPE_WS2812) {
        return set_output_brightness_locked(out, ws2812_brightness_from_percent(level));
    } else if (out->type == OUTPUT_TYPE_SERVO_3WIRE) {
        out->cfg.servo_3wire.level = level;
        out->power = true;
    } else if (out->type == OUTPUT_TYPE_SERVO_5WIRE) {
        out->cfg.servo_5wire.target_level = level;
        out->cfg.servo_5wire.timed_out = false;
        out->power = out->cfg.servo_5wire.moving;
    } else if (out->type == OUTPUT_TYPE_CLOCK_4X4094) {
        out->cfg.clock_4x4094.level = level;
        out->power = (level > 0);
        return output_apply_physical_state(out);
    } else if (out->type == OUTPUT_TYPE_STEPPER_28BYJ) {
        out->cfg.stepper_28byj.homing = false;
        out->cfg.stepper_28byj.target_level = level;
        out->cfg.stepper_28byj.target_position_steps = stepper_level_to_position(level, out->cfg.stepper_28byj.steps_range);
        if (out->cfg.stepper_28byj.home_gpio >= 0 && level == 0 && stepper_28byj_home_active_locked(out)) {
            stepper_28byj_finish_home_locked(out);
            return ESP_OK;
        }
        out->cfg.stepper_28byj.last_step_us = 0;
        out->cfg.stepper_28byj.moving =
            out->cfg.stepper_28byj.current_position_steps != out->cfg.stepper_28byj.target_position_steps;
        out->power = out->cfg.stepper_28byj.moving || out->cfg.stepper_28byj.hold_enabled;
        if (!out->cfg.stepper_28byj.moving && !out->cfg.stepper_28byj.hold_enabled) {
            (void)stepper_28byj_release_locked(out);
            out->power = false;
        }
        return ESP_OK;
    } else if (out->type == OUTPUT_TYPE_STEPPER_A4988) {
        out->cfg.stepper_a4988.homing = false;
        out->cfg.stepper_a4988.target_level = level;
        out->cfg.stepper_a4988.target_position_steps = stepper_level_to_position(level, out->cfg.stepper_a4988.steps_range);
        if (out->cfg.stepper_a4988.home_gpio >= 0 && level == 0 && stepper_a4988_home_active_locked(out)) {
            stepper_a4988_finish_home_locked(out);
            return ESP_OK;
        }
        out->cfg.stepper_a4988.last_step_us = 0;
        out->cfg.stepper_a4988.moving =
            out->cfg.stepper_a4988.current_position_steps != out->cfg.stepper_a4988.target_position_steps;
        out->power = out->cfg.stepper_a4988.moving || out->cfg.stepper_a4988.hold_enabled;
        if (!out->cfg.stepper_a4988.moving && !out->cfg.stepper_a4988.hold_enabled) {
            (void)stepper_a4988_set_enable_locked(out, false);
            out->power = false;
        }
        return ESP_OK;
    } else {
        return ESP_ERR_INVALID_ARG;
    }

    if (out->type == OUTPUT_TYPE_SERVO_5WIRE) {
        (void)update_servo_5wire_control_locked(out, esp_timer_get_time());
        return ESP_OK;
    }

    return output_apply_physical_state(out);
}

static esp_err_t set_output_brightness_locked(output_runtime_t *out, int brightness)
{
    if (!out || !out->enabled || out->type != OUTPUT_TYPE_WS2812) {
        return ESP_ERR_INVALID_STATE;
    }

    brightness = clamp_ws2812_brightness(brightness);
    out->cfg.ws2812.level = brightness;
    out->power = (brightness > 0);
    return output_apply_physical_state(out);
}

static esp_err_t start_output_test_locked(output_runtime_t *out, int duration_ms)
{
    int test_level = 100;

    if (!out || !out->used || !out->enabled) {
        return ESP_ERR_INVALID_STATE;
    }
    if (!out->supported) {
        return ESP_ERR_NOT_SUPPORTED;
    }

    if (duration_ms < 100) {
        duration_ms = 100;
    }
    if (duration_ms > 10000) {
        duration_ms = 10000;
    }

    if (!out->test_active) {
        out->test_restore_power = out->power;

        switch (out->type) {
            case OUTPUT_TYPE_PWM:
                out->test_restore_level = out->cfg.pwm.level;
                break;
            case OUTPUT_TYPE_WS2812:
                out->test_restore_level = out->cfg.ws2812.level;
                out->test_restore_red = out->cfg.ws2812.red;
                out->test_restore_green = out->cfg.ws2812.green;
                out->test_restore_blue = out->cfg.ws2812.blue;
                break;
            case OUTPUT_TYPE_SERVO_3WIRE:
                out->test_restore_level = out->cfg.servo_3wire.level;
                break;
            case OUTPUT_TYPE_SERVO_5WIRE:
                out->test_restore_level = out->cfg.servo_5wire.target_level;
                break;
            case OUTPUT_TYPE_CLOCK_4X4094:
                out->test_restore_level = out->cfg.clock_4x4094.level;
                break;
            case OUTPUT_TYPE_STEPPER_28BYJ:
                out->test_restore_level = out->cfg.stepper_28byj.target_level;
                break;
            case OUTPUT_TYPE_STEPPER_A4988:
                out->test_restore_level = out->cfg.stepper_a4988.target_level;
                break;
            default:
                break;
        }
    }

    out->test_active = true;
    out->test_restore_at_us = esp_timer_get_time() + ((int64_t)duration_ms * 1000LL);

    switch (out->type) {
        case OUTPUT_TYPE_RELAY:
            out->power = true;
            return output_apply_physical_state(out);
        case OUTPUT_TYPE_PWM:
            out->cfg.pwm.level = 100;
            out->power = true;
            return output_apply_physical_state(out);
        case OUTPUT_TYPE_WS2812:
            out->cfg.ws2812.transition_active = false;
            out->cfg.ws2812.level = WS2812_BRIGHTNESS_MAX;
            out->cfg.ws2812.red = 255;
            out->cfg.ws2812.green = 255;
            out->cfg.ws2812.blue = 255;
            out->power = true;
            return apply_ws2812_target_locked(out, false);
        case OUTPUT_TYPE_SERVO_3WIRE:
            test_level = out->cfg.servo_3wire.level > 50 ? 0 : 100;
            out->cfg.servo_3wire.level = test_level;
            out->power = true;
            return output_apply_physical_state(out);
        case OUTPUT_TYPE_SERVO_5WIRE:
            test_level = out->cfg.servo_5wire.current_level > 50 ? 0 : 100;
            out->cfg.servo_5wire.target_level = test_level;
            out->cfg.servo_5wire.timed_out = false;
            (void)update_servo_5wire_control_locked(out, esp_timer_get_time());
            return ESP_OK;
        case OUTPUT_TYPE_CLOCK_4X4094:
            out->power = true;
            out->cfg.clock_4x4094.level = 100;
            return output_apply_physical_state(out);
        case OUTPUT_TYPE_STEPPER_28BYJ:
            test_level = out->cfg.stepper_28byj.current_level > 50 ? 0 : 100;
            return set_output_level_locked(out, test_level);
        case OUTPUT_TYPE_STEPPER_A4988:
            test_level = out->cfg.stepper_a4988.current_level > 50 ? 0 : 100;
            return set_output_level_locked(out, test_level);
        default:
            out->test_active = false;
            out->test_restore_at_us = 0;
            return ESP_ERR_NOT_SUPPORTED;
    }
}

static bool process_output_test_locked(output_runtime_t *out, int64_t now_us)
{
    esp_err_t err = ESP_OK;

    if (!out || !out->test_active) {
        return false;
    }
    if (now_us < out->test_restore_at_us) {
        return false;
    }

    out->test_active = false;
    out->test_restore_at_us = 0;

    switch (out->type) {
        case OUTPUT_TYPE_RELAY:
            out->power = out->test_restore_power;
            err = output_apply_physical_state(out);
            break;
        case OUTPUT_TYPE_PWM:
            out->cfg.pwm.level = out->test_restore_level;
            out->power = out->test_restore_power;
            err = output_apply_physical_state(out);
            break;
        case OUTPUT_TYPE_WS2812:
            out->cfg.ws2812.transition_active = false;
            out->cfg.ws2812.level = out->test_restore_level;
            out->cfg.ws2812.red = out->test_restore_red;
            out->cfg.ws2812.green = out->test_restore_green;
            out->cfg.ws2812.blue = out->test_restore_blue;
            out->power = out->test_restore_power;
            err = apply_ws2812_target_locked(out, false);
            break;
        case OUTPUT_TYPE_SERVO_3WIRE:
            out->cfg.servo_3wire.level = out->test_restore_level;
            out->power = true;
            err = output_apply_physical_state(out);
            break;
        case OUTPUT_TYPE_SERVO_5WIRE:
            out->cfg.servo_5wire.target_level = out->test_restore_level;
            out->cfg.servo_5wire.timed_out = false;
            (void)update_servo_5wire_control_locked(out, now_us);
            err = ESP_OK;
            break;
        case OUTPUT_TYPE_CLOCK_4X4094:
            out->power = out->test_restore_power;
            out->cfg.clock_4x4094.level = out->test_restore_level;
            err = output_apply_physical_state(out);
            break;
        case OUTPUT_TYPE_STEPPER_28BYJ:
        case OUTPUT_TYPE_STEPPER_A4988:
            err = set_output_level_locked(out, out->test_restore_level);
            break;
        default:
            err = ESP_ERR_NOT_SUPPORTED;
            break;
    }

    if (err != ESP_OK) {
        ESP_LOGW(TAG, "output test restore failed for %s: %s", out->id, esp_err_to_name(err));
    }

