klactrafob/esp32-c3_matter/src/core/modules.c
    return true;
}

static void clear_runtime_locked(void)
{
    for (int i = 0; i < s_runtime.output_count; ++i) {
        output_runtime_t *out = &s_runtime.outputs[i];
        if (!out->used) {
            continue;
        }
        if (out->type == OUTPUT_TYPE_WS2812 && out->cfg.ws2812.strip) {
            (void)led_strip_clear(out->cfg.ws2812.strip);
            (void)led_strip_del(out->cfg.ws2812.strip);
            out->cfg.ws2812.strip = NULL;
        }
        if (out->type == OUTPUT_TYPE_PWM) {
            (void)ledc_stop(LEDC_LOW_SPEED_MODE, out->cfg.pwm.channel, 0);
            if (out->cfg.pwm.power_relay_gpio >= 0) {
                gpio_reset_pin((gpio_num_t)out->cfg.pwm.power_relay_gpio);
            }
        }
        if (out->type == OUTPUT_TYPE_SERVO_3WIRE) {
            (void)ledc_stop(LEDC_LOW_SPEED_MODE, out->cfg.servo_3wire.channel, 0);
        }
        if (out->type == OUTPUT_TYPE_SERVO_5WIRE && out->cfg.servo_5wire.gpio_b >= 0) {
            (void)servo_5wire_set_drive_locked(out, 0);
            gpio_reset_pin((gpio_num_t)out->cfg.servo_5wire.gpio_b);
        }
        if (out->type == OUTPUT_TYPE_CLOCK_4X4094) {
            if (out->cfg.clock_4x4094.brightness_gpio >= 0) {
                (void)ledc_stop(LEDC_LOW_SPEED_MODE, out->cfg.clock_4x4094.channel, 0);
                gpio_reset_pin((gpio_num_t)out->cfg.clock_4x4094.brightness_gpio);
            }
            if (out->cfg.clock_4x4094.gpio_b >= 0) {
                gpio_reset_pin((gpio_num_t)out->cfg.clock_4x4094.gpio_b);
            }
            if (out->cfg.clock_4x4094.gpio_c >= 0) {
                gpio_reset_pin((gpio_num_t)out->cfg.clock_4x4094.gpio_c);
            }
        }
        if (out->type == OUTPUT_TYPE_STEPPER_28BYJ) {
            (void)stepper_28byj_release_locked(out);
            if (out->cfg.stepper_28byj.gpio_b >= 0) {
                gpio_reset_pin((gpio_num_t)out->cfg.stepper_28byj.gpio_b);
            }
            if (out->cfg.stepper_28byj.gpio_c >= 0) {
                gpio_reset_pin((gpio_num_t)out->cfg.stepper_28byj.gpio_c);
            }
            if (out->cfg.stepper_28byj.gpio_d >= 0) {
                gpio_reset_pin((gpio_num_t)out->cfg.stepper_28byj.gpio_d);
            }
            if (out->cfg.stepper_28byj.home_gpio >= 0) {
                gpio_reset_pin((gpio_num_t)out->cfg.stepper_28byj.home_gpio);
            }
        }
        if (out->type == OUTPUT_TYPE_STEPPER_A4988) {
            (void)stepper_a4988_set_enable_locked(out, false);
            if (out->cfg.stepper_a4988.gpio_b >= 0) {
                gpio_reset_pin((gpio_num_t)out->cfg.stepper_a4988.gpio_b);
            }
            if (out->cfg.stepper_a4988.gpio_c >= 0) {
                gpio_reset_pin((gpio_num_t)out->cfg.stepper_a4988.gpio_c);
            }
            if (out->cfg.stepper_a4988.home_gpio >= 0) {
                gpio_reset_pin((gpio_num_t)out->cfg.stepper_a4988.home_gpio);
            }
        }
        if (out->gpio >= 0) {
            gpio_reset_pin((gpio_num_t)out->gpio);
        }
    }

    for (int i = 0; i < s_runtime.input_count; ++i) {
        if (s_runtime.inputs[i].used && s_runtime.inputs[i].gpio >= 0) {
            gpio_reset_pin((gpio_num_t)s_runtime.inputs[i].gpio);
        }
    }
    for (int i = 0; i < s_runtime.button_count; ++i) {
        if (s_runtime.buttons[i].used && s_runtime.buttons[i].gpio >= 0) {
            gpio_reset_pin((gpio_num_t)s_runtime.buttons[i].gpio);
        }
    }

    for (int i = 0; i < s_runtime.sensor_count; ++i) {
        sensor_runtime_t *sensor = &s_runtime.sensors[i];
        if (!sensor->used) {
            continue;
        }
        if (strcmp(sensor->type, "aht20") == 0 && sensor->dev.aht20) {
            (void)aht20_del_sensor(sensor->dev.aht20);
        } else if (strcmp(sensor->type, "sht3x") == 0 && sensor->dev.sht3x) {
            (void)sht3x_delete(&sensor->dev.sht3x);
        } else if (strcmp(sensor->type, "bme280") == 0 && sensor->dev.bme280) {
            (void)bme280_delete(&sensor->dev.bme280);
        }
    }

    for (int i = 0; i < s_runtime.ds18b20.device_count; ++i) {
        if (s_runtime.ds18b20.devices[i]) {
            (void)ds18b20_del_device(s_runtime.ds18b20.devices[i]);
            s_runtime.ds18b20.devices[i] = NULL;
        }
    }
    if (s_runtime.ds18b20.bus) {
        (void)onewire_bus_del(s_runtime.ds18b20.bus);
        s_runtime.ds18b20.bus = NULL;
    }
    if (s_runtime.i2c.bus) {
        (void)i2c_bus_delete(&s_runtime.i2c.bus);
    }
    if (s_runtime.adc.handle) {
        (void)adc_oneshot_del_unit(s_runtime.adc.handle);
        s_runtime.adc.handle = NULL;
    }

    memset(&s_runtime, 0, sizeof(s_runtime));
}

static esp_err_t configure_output(output_runtime_t *out, const cJSON *item, ledc_allocator_t *ledc_alloc)
{
    memset(out, 0, sizeof(*out));
    out->used = true;
    out->enabled = jbool(item, "enabled", true);
    out->type = output_type_from_text(jstr(item, "type", "relay"));
    out->gpio = jint(item, "gpio", -1);
    out->supported = true;
    snprintf(out->id, sizeof(out->id), "%s", jstr(item, "id", ""));
    snprintf(out->name, sizeof(out->name), "%s", jstr(item, "name", out->id));
    snprintf(out->role, sizeof(out->role), "%s", jstr(item, "role", "generic"));
    snprintf(out->mqtt_component, sizeof(out->mqtt_component), "%s",
             normalize_output_mqtt_component(jstr(item, "mqtt_component", "auto")));
    snprintf(out->mqtt_number_mode, sizeof(out->mqtt_number_mode), "%s",
             normalize_output_mqtt_number_mode(jstr(item, "mqtt_number_mode", "slider")));

    if (!out->enabled) {
        return ESP_OK;
    }

    if (output_uses_plain_gpio(out->type)) {
        gpio_config_t io = {
            .pin_bit_mask = 1ULL << out->gpio,
            .mode = GPIO_MODE_OUTPUT,
            .pull_up_en = GPIO_PULLUP_DISABLE,
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .intr_type = GPIO_INTR_DISABLE,
        };
        ESP_RETURN_ON_ERROR(gpio_config(&io), TAG, "gpio setup failed for %s", out->id);
    }

    if (out->type == OUTPUT_TYPE_RELAY) {
        out->cfg.relay.active_level = jint(item, "active_level", 1) ? 1 : 0;
        out->cfg.relay.default_on = jbool(item, "default_on", false);
        out->power = out->cfg.relay.default_on;
        return output_apply_physical_state(out);
    }

    if (out->type == OUTPUT_TYPE_PWM) {
        out->cfg.pwm.freq_hz = jint(item, "freq_hz", 1000);
        out->cfg.pwm.inverted = jbool(item, "inverted", false);
        out->cfg.pwm.level = jint(item, "default_level", 0);
        out->cfg.pwm.max_level_pct = jint(item, "max_level_pct", 100);
        if (out->cfg.pwm.max_level_pct < 1) {
            out->cfg.pwm.max_level_pct = 1;
        }
        if (out->cfg.pwm.max_level_pct > 100) {
            out->cfg.pwm.max_level_pct = 100;
        }
        out->cfg.pwm.power_relay_gpio = jint(item, "power_relay_gpio", -1);
        out->cfg.pwm.power_relay_active_level = jint(item, "power_relay_active_level", 1) ? 1 : 0;
        ESP_RETURN_ON_ERROR(ledc_allocator_acquire(ledc_alloc, out->cfg.pwm.freq_hz, LEDC_TIMER_13_BIT,
                                                   &out->cfg.pwm.channel, &out->cfg.pwm.timer),
                            TAG, "LEDC exhausted for PWM output %s", out->id);
        out->power = out->cfg.pwm.level > 0;

        ledc_timer_config_t timer_cfg = {
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .timer_num = out->cfg.pwm.timer,
            .duty_resolution = LEDC_TIMER_13_BIT,
            .freq_hz = out->cfg.pwm.freq_hz,
            .clk_cfg = LEDC_AUTO_CLK,
        };
        ESP_RETURN_ON_ERROR(ledc_timer_config(&timer_cfg), TAG, "LEDC timer config failed for %s", out->id);

