klactrafob/esp32-c3_matter/src/core/modules.c
        ledc_channel_config_t chan_cfg = {
            .gpio_num = out->gpio,
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .channel = out->cfg.pwm.channel,
            .intr_type = LEDC_INTR_DISABLE,
            .timer_sel = out->cfg.pwm.timer,
            .duty = 0,
            .hpoint = 0,
        };
        ESP_RETURN_ON_ERROR(ledc_channel_config(&chan_cfg), TAG, "LEDC channel config failed for %s", out->id);

        if (out->cfg.pwm.power_relay_gpio >= 0) {
            gpio_config_t relay_io = {
                .pin_bit_mask = 1ULL << out->cfg.pwm.power_relay_gpio,
                .mode = GPIO_MODE_OUTPUT,
                .pull_up_en = GPIO_PULLUP_DISABLE,
                .pull_down_en = GPIO_PULLDOWN_DISABLE,
                .intr_type = GPIO_INTR_DISABLE,
            };
            ESP_RETURN_ON_ERROR(gpio_config(&relay_io), TAG, "PWM relay gpio setup failed for %s", out->id);
            ESP_RETURN_ON_ERROR(set_pwm_power_relay_locked(out, false), TAG, "PWM relay init failed for %s", out->id);
        }
        return output_apply_physical_state(out);
    }

    if (out->type == OUTPUT_TYPE_SERVO_3WIRE) {
        out->cfg.servo_3wire.level = jint(item, "default_level", 0);
        out->cfg.servo_3wire.min_us = jint(item, "min_us", 500);
        out->cfg.servo_3wire.max_us = jint(item, "max_us", 2500);
        out->cfg.servo_3wire.reverse_direction = jbool(item, "reverse_direction", false);
        out->cfg.servo_3wire.hold_power_ms = jint(item, "hold_power_ms", SERVO_3WIRE_HOLD_MS_DEFAULT);
        if (out->cfg.servo_3wire.level < 0) {
            out->cfg.servo_3wire.level = 0;
        }
        if (out->cfg.servo_3wire.level > 100) {
            out->cfg.servo_3wire.level = 100;
        }
        if (out->cfg.servo_3wire.min_us < 400) {
            out->cfg.servo_3wire.min_us = 400;
        }
        if (out->cfg.servo_3wire.max_us > 2600) {
            out->cfg.servo_3wire.max_us = 2600;
        }
        if (out->cfg.servo_3wire.max_us <= out->cfg.servo_3wire.min_us) {
            out->cfg.servo_3wire.max_us = out->cfg.servo_3wire.min_us + 100;
        }
        if (out->cfg.servo_3wire.hold_power_ms < 0) {
            out->cfg.servo_3wire.hold_power_ms = 0;
        }
        if (out->cfg.servo_3wire.hold_power_ms > 10000) {
            out->cfg.servo_3wire.hold_power_ms = 10000;
        }
        out->cfg.servo_3wire.release_at_us = 0;

        ESP_RETURN_ON_ERROR(ledc_allocator_acquire(ledc_alloc, 50, LEDC_TIMER_13_BIT,
                                                   &out->cfg.servo_3wire.channel, &out->cfg.servo_3wire.timer),
                            TAG, "LEDC exhausted for servo output %s", out->id);
        out->power = true;

        ledc_timer_config_t timer_cfg = {
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .timer_num = out->cfg.servo_3wire.timer,
            .duty_resolution = LEDC_TIMER_13_BIT,
            .freq_hz = 50,
            .clk_cfg = LEDC_AUTO_CLK,
        };
        ESP_RETURN_ON_ERROR(ledc_timer_config(&timer_cfg), TAG, "LEDC timer config failed for %s", out->id);

        ledc_channel_config_t chan_cfg = {
            .gpio_num = out->gpio,
            .speed_mode = LEDC_LOW_SPEED_MODE,
            .channel = out->cfg.servo_3wire.channel,
            .intr_type = LEDC_INTR_DISABLE,
            .timer_sel = out->cfg.servo_3wire.timer,
            .duty = 0,
            .hpoint = 0,
        };
        ESP_RETURN_ON_ERROR(ledc_channel_config(&chan_cfg), TAG, "LEDC channel config failed for %s", out->id);
        return output_apply_physical_state(out);
    }

    if (out->type == OUTPUT_TYPE_SERVO_5WIRE) {
        out->cfg.servo_5wire.gpio_b = jint(item, "gpio_b", -1);
        out->cfg.servo_5wire.feedback_gpio = jint(item, "feedback_gpio", -1);
        out->cfg.servo_5wire.feedback_min_raw = jint(item, "feedback_min_raw", 300);
        out->cfg.servo_5wire.feedback_max_raw = jint(item, "feedback_max_raw", 3700);
        out->cfg.servo_5wire.deadband_pct = jint(item, "deadband_pct", 2);
        out->cfg.servo_5wire.move_timeout_ms = jint(item, "move_timeout_ms", 15000);
        out->cfg.servo_5wire.reverse_direction = jbool(item, "reverse_direction", false);
        out->cfg.servo_5wire.target_level = jint(item, "default_level", 0);
        out->cfg.servo_5wire.feedback_raw = 0;
        out->cfg.servo_5wire.current_level = 0;
        out->cfg.servo_5wire.drive_state = 0;
        out->cfg.servo_5wire.moving = false;
        out->cfg.servo_5wire.timed_out = false;
        if (out->cfg.servo_5wire.target_level < 0) {
            out->cfg.servo_5wire.target_level = 0;
        }
        if (out->cfg.servo_5wire.target_level > 100) {
            out->cfg.servo_5wire.target_level = 100;
        }
        if (out->cfg.servo_5wire.deadband_pct < 1) {
            out->cfg.servo_5wire.deadband_pct = 1;
        }
        if (out->cfg.servo_5wire.deadband_pct > 20) {
            out->cfg.servo_5wire.deadband_pct = 20;
        }
        if (out->cfg.servo_5wire.move_timeout_ms < 1000) {
            out->cfg.servo_5wire.move_timeout_ms = 1000;
        }
        if (out->cfg.servo_5wire.move_timeout_ms > 60000) {
            out->cfg.servo_5wire.move_timeout_ms = 60000;
        }

        gpio_config_t io_b = {
            .pin_bit_mask = 1ULL << out->cfg.servo_5wire.gpio_b,
            .mode = GPIO_MODE_OUTPUT,
            .pull_up_en = GPIO_PULLUP_DISABLE,
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .intr_type = GPIO_INTR_DISABLE,
        };
        ESP_RETURN_ON_ERROR(gpio_config(&io_b), TAG, "servo gpio setup failed for %s", out->id);
        ESP_RETURN_ON_ERROR(ensure_adc_channel_locked(out->cfg.servo_5wire.feedback_gpio,
                                                     &out->cfg.servo_5wire.adc_channel),
                            TAG, "servo adc setup failed for %s", out->id);
        out->supported = true;
        out->power = false;
        ESP_RETURN_ON_ERROR(servo_5wire_set_drive_locked(out, 0), TAG, "servo init failed for %s", out->id);
        (void)update_servo_5wire_control_locked(out, esp_timer_get_time());
        return ESP_OK;
    }

