klactrafob/esp32-c3_matter/src/core/modules.c
    if (out->type == OUTPUT_TYPE_CLOCK_4X4094) {
        out->cfg.clock_4x4094.gpio_b = jint(item, "gpio_b", -1);
        out->cfg.clock_4x4094.gpio_c = jint(item, "gpio_c", -1);
        out->cfg.clock_4x4094.brightness_gpio = jint(item, "brightness_gpio", -1);
        out->cfg.clock_4x4094.segment_map[0] = (uint8_t)(jint(item, "segment_a", 1) - 1);
        out->cfg.clock_4x4094.segment_map[1] = (uint8_t)(jint(item, "segment_b", 2) - 1);
        out->cfg.clock_4x4094.segment_map[2] = (uint8_t)(jint(item, "segment_c", 3) - 1);
        out->cfg.clock_4x4094.segment_map[3] = (uint8_t)(jint(item, "segment_d", 4) - 1);
        out->cfg.clock_4x4094.segment_map[4] = (uint8_t)(jint(item, "segment_e", 5) - 1);
        out->cfg.clock_4x4094.segment_map[5] = (uint8_t)(jint(item, "segment_f", 6) - 1);
        out->cfg.clock_4x4094.segment_map[6] = (uint8_t)(jint(item, "segment_g", 7) - 1);
        out->cfg.clock_4x4094.segment_map[7] = (uint8_t)(jint(item, "segment_dp", 8) - 1);
        out->cfg.clock_4x4094.level = jint(item, "default_level", 100);
        out->cfg.clock_4x4094.blink_period_ms = jint(item, "blink_period_ms", 2000);
        out->cfg.clock_4x4094.timezone_offset_min = jint(item, "timezone_offset_min", 0);
        out->cfg.clock_4x4094.default_on = jbool(item, "default_on", true);
        out->cfg.clock_4x4094.common_anode = jbool(item, "common_anode", false);
        out->cfg.clock_4x4094.mirror_segments = jbool(item, "mirror_segments", true);
        out->cfg.clock_4x4094.reverse_digits = jbool(item, "reverse_digits", false);
        out->cfg.clock_4x4094.leading_zero = jbool(item, "leading_zero", true);
        out->cfg.clock_4x4094.blink_separator = jbool(item, "blink_separator", true);
        out->cfg.clock_4x4094.time_valid = false;
        out->cfg.clock_4x4094.separator_on = false;
        out->cfg.clock_4x4094.display_hour = -1;
        out->cfg.clock_4x4094.display_minute = -1;
        out->cfg.clock_4x4094.last_render_us = 0;
        memset(out->cfg.clock_4x4094.display_text, 0, sizeof(out->cfg.clock_4x4094.display_text));
        memset(out->cfg.clock_4x4094.segments, 0, sizeof(out->cfg.clock_4x4094.segments));

        if (out->cfg.clock_4x4094.timezone_offset_min < -720) {
            out->cfg.clock_4x4094.timezone_offset_min = -720;
        }
        if (out->cfg.clock_4x4094.timezone_offset_min > 840) {
            out->cfg.clock_4x4094.timezone_offset_min = 840;
        }
        if (out->cfg.clock_4x4094.level < 0) {
            out->cfg.clock_4x4094.level = 0;
        }
        if (out->cfg.clock_4x4094.level > 100) {
            out->cfg.clock_4x4094.level = 100;
        }
        if (out->cfg.clock_4x4094.blink_period_ms < 200) {
            out->cfg.clock_4x4094.blink_period_ms = 200;
        }
        if (out->cfg.clock_4x4094.blink_period_ms > 10000) {
            out->cfg.clock_4x4094.blink_period_ms = 10000;
        }
        for (int seg = 0; seg < 8; ++seg) {
            if (out->cfg.clock_4x4094.segment_map[seg] > 7U) {
                out->cfg.clock_4x4094.segment_map[seg] = (uint8_t)seg;
            }
        }
        if (out->cfg.clock_4x4094.gpio_b < 0 || out->cfg.clock_4x4094.gpio_c < 0) {
            return ESP_ERR_INVALID_ARG;
        }

        gpio_config_t extra_io = {
            .pin_bit_mask = (1ULL << out->cfg.clock_4x4094.gpio_b) |
                            (1ULL << out->cfg.clock_4x4094.gpio_c),
            .mode = GPIO_MODE_OUTPUT,
            .pull_up_en = GPIO_PULLUP_DISABLE,
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .intr_type = GPIO_INTR_DISABLE,
        };
        ESP_RETURN_ON_ERROR(gpio_config(&extra_io), TAG, "clock gpio setup failed for %s", out->id);
        ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->cfg.clock_4x4094.gpio_b, 0), TAG, "clock clk init failed for %s", out->id);
        ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->cfg.clock_4x4094.gpio_c, 0), TAG, "clock latch init failed for %s", out->id);
        if (out->cfg.clock_4x4094.brightness_gpio >= 0) {
            ESP_RETURN_ON_ERROR(ledc_allocator_acquire(ledc_alloc, 1000, LEDC_TIMER_13_BIT,
                                                       &out->cfg.clock_4x4094.channel, &out->cfg.clock_4x4094.timer),
                                TAG, "LEDC exhausted for clock output %s", out->id);
            ledc_timer_config_t timer_cfg = {
                .speed_mode = LEDC_LOW_SPEED_MODE,
                .timer_num = out->cfg.clock_4x4094.timer,
                .duty_resolution = LEDC_TIMER_13_BIT,
                .freq_hz = 1000,
                .clk_cfg = LEDC_AUTO_CLK,
            };
            ESP_RETURN_ON_ERROR(ledc_timer_config(&timer_cfg), TAG, "clock LEDC timer config failed for %s", out->id);

            ledc_channel_config_t chan_cfg = {
                .gpio_num = out->cfg.clock_4x4094.brightness_gpio,
                .speed_mode = LEDC_LOW_SPEED_MODE,
                .channel = out->cfg.clock_4x4094.channel,
                .intr_type = LEDC_INTR_DISABLE,
                .timer_sel = out->cfg.clock_4x4094.timer,
                .duty = 0,
                .hpoint = 0,
            };
            ESP_RETURN_ON_ERROR(ledc_channel_config(&chan_cfg), TAG, "clock LEDC channel config failed for %s", out->id);
        }
        out->power = out->cfg.clock_4x4094.default_on && out->cfg.clock_4x4094.level > 0;
        return output_apply_physical_state(out);
    }

    if (out->type == OUTPUT_TYPE_STEPPER_28BYJ) {
        if (strcmp(out->role, "cover") != 0) {
            snprintf(out->role, sizeof(out->role), "%s", "generic");
        }
        out->cfg.stepper_28byj.gpio_b = jint(item, "gpio_b", -1);
        out->cfg.stepper_28byj.gpio_c = jint(item, "gpio_c", -1);
        out->cfg.stepper_28byj.gpio_d = jint(item, "gpio_d", -1);
        out->cfg.stepper_28byj.home_gpio = jint(item, "home_gpio", -1);
        out->cfg.stepper_28byj.home_pull_mode = pull_mode_from_text(jstr(item, "home_pull", "up"));
        out->cfg.stepper_28byj.home_inverted = jbool(item, "home_inverted", false);
        out->cfg.stepper_28byj.auto_home_on_boot = jbool(item, "auto_home_on_boot", false);
        out->cfg.stepper_28byj.steps_range = jint(item, "steps_range", 2048);
        out->cfg.stepper_28byj.speed_steps_per_sec = jint(item, "speed_steps_per_sec", 400);
        out->cfg.stepper_28byj.reverse_direction = jbool(item, "reverse_direction", false);
        out->cfg.stepper_28byj.hold_enabled = jbool(item, "hold_enabled", false);
        out->cfg.stepper_28byj.target_level = jint(item, "default_level", 0);
        if (out->cfg.stepper_28byj.steps_range < 32) {
            out->cfg.stepper_28byj.steps_range = 32;
        }
        if (out->cfg.stepper_28byj.steps_range > 200000) {
            out->cfg.stepper_28byj.steps_range = 200000;
        }
        if (out->cfg.stepper_28byj.speed_steps_per_sec < 10) {
            out->cfg.stepper_28byj.speed_steps_per_sec = 10;
        }
        if (out->cfg.stepper_28byj.speed_steps_per_sec > 1500) {
            out->cfg.stepper_28byj.speed_steps_per_sec = 1500;
        }
        if (out->cfg.stepper_28byj.target_level < 0) {
            out->cfg.stepper_28byj.target_level = 0;
        }
        if (out->cfg.stepper_28byj.target_level > 100) {
            out->cfg.stepper_28byj.target_level = 100;
        }
        if (out->cfg.stepper_28byj.gpio_b < 0 || out->cfg.stepper_28byj.gpio_c < 0 || out->cfg.stepper_28byj.gpio_d < 0) {
            return ESP_ERR_INVALID_ARG;
        }
        out->cfg.stepper_28byj.target_position_steps =
            stepper_level_to_position(out->cfg.stepper_28byj.target_level, out->cfg.stepper_28byj.steps_range);
        out->cfg.stepper_28byj.current_position_steps = out->cfg.stepper_28byj.target_position_steps;
        out->cfg.stepper_28byj.current_level = out->cfg.stepper_28byj.target_level;
        out->cfg.stepper_28byj.phase_index = out->cfg.stepper_28byj.current_position_steps % 8;
        out->cfg.stepper_28byj.home_active = false;
        out->cfg.stepper_28byj.homing = false;
        out->cfg.stepper_28byj.homed = false;
        out->cfg.stepper_28byj.moving = false;
        out->cfg.stepper_28byj.last_step_us = 0;

