klactrafob/esp32-c3_matter/src/core/modules.c
        gpio_config_t extra_io = {
            .pin_bit_mask = (1ULL << out->cfg.stepper_28byj.gpio_b) |
                            (1ULL << out->cfg.stepper_28byj.gpio_c) |
                            (1ULL << out->cfg.stepper_28byj.gpio_d),
            .mode = GPIO_MODE_OUTPUT,
            .pull_up_en = GPIO_PULLUP_DISABLE,
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .intr_type = GPIO_INTR_DISABLE,
        };
        ESP_RETURN_ON_ERROR(gpio_config(&extra_io), TAG, "stepper gpio setup failed for %s", out->id);
        if (out->cfg.stepper_28byj.home_gpio >= 0) {
            gpio_config_t home_io = {
                .pin_bit_mask = 1ULL << out->cfg.stepper_28byj.home_gpio,
                .mode = GPIO_MODE_INPUT,
                .pull_up_en = (out->cfg.stepper_28byj.home_pull_mode == GPIO_PULLUP_ONLY) ? GPIO_PULLUP_ENABLE : GPIO_PULLUP_DISABLE,
                .pull_down_en = (out->cfg.stepper_28byj.home_pull_mode == GPIO_PULLDOWN_ONLY) ? GPIO_PULLDOWN_ENABLE : GPIO_PULLDOWN_DISABLE,
                .intr_type = GPIO_INTR_DISABLE,
            };
            ESP_RETURN_ON_ERROR(gpio_config(&home_io), TAG, "stepper home gpio setup failed for %s", out->id);
            if (stepper_28byj_home_active_locked(out)) {
                stepper_28byj_finish_home_locked(out);
                return ESP_OK;
            }
            if (out->cfg.stepper_28byj.auto_home_on_boot) {
                ESP_RETURN_ON_ERROR(stepper_28byj_start_home_locked(out), TAG, "stepper home init failed for %s", out->id);
                return ESP_OK;
            }
        }
        if (out->cfg.stepper_28byj.hold_enabled) {
            ESP_RETURN_ON_ERROR(stepper_28byj_apply_phase_locked(out, out->cfg.stepper_28byj.phase_index),
                                TAG, "stepper hold init failed for %s", out->id);
            out->power = true;
        } else {
            ESP_RETURN_ON_ERROR(stepper_28byj_release_locked(out), TAG, "stepper release init failed for %s", out->id);
            out->power = false;
        }
        return ESP_OK;
    }

    if (out->type == OUTPUT_TYPE_STEPPER_A4988) {
        if (strcmp(out->role, "cover") != 0) {
            snprintf(out->role, sizeof(out->role), "%s", "generic");
        }
        out->cfg.stepper_a4988.gpio_b = jint(item, "gpio_b", -1);
        out->cfg.stepper_a4988.gpio_c = jint(item, "gpio_c", -1);
        out->cfg.stepper_a4988.home_gpio = jint(item, "home_gpio", -1);
        out->cfg.stepper_a4988.home_pull_mode = pull_mode_from_text(jstr(item, "home_pull", "up"));
        out->cfg.stepper_a4988.home_inverted = jbool(item, "home_inverted", false);
        out->cfg.stepper_a4988.auto_home_on_boot = jbool(item, "auto_home_on_boot", false);
        out->cfg.stepper_a4988.enable_active_level = jint(item, "enable_active_level", 0) ? 1 : 0;
        out->cfg.stepper_a4988.steps_range = jint(item, "steps_range", 200);
        out->cfg.stepper_a4988.speed_steps_per_sec = jint(item, "speed_steps_per_sec", 800);
        out->cfg.stepper_a4988.step_pulse_us = jint(item, "step_pulse_us", 4);
        out->cfg.stepper_a4988.reverse_direction = jbool(item, "reverse_direction", false);
        out->cfg.stepper_a4988.hold_enabled = jbool(item, "hold_enabled", false);
        out->cfg.stepper_a4988.target_level = jint(item, "default_level", 0);
        if (out->cfg.stepper_a4988.steps_range < 32) {
            out->cfg.stepper_a4988.steps_range = 32;
        }
        if (out->cfg.stepper_a4988.steps_range > 200000) {
            out->cfg.stepper_a4988.steps_range = 200000;
        }
        if (out->cfg.stepper_a4988.speed_steps_per_sec < 10) {
            out->cfg.stepper_a4988.speed_steps_per_sec = 10;
        }
        if (out->cfg.stepper_a4988.speed_steps_per_sec > 20000) {
            out->cfg.stepper_a4988.speed_steps_per_sec = 20000;
        }
        if (out->cfg.stepper_a4988.step_pulse_us < 2) {
            out->cfg.stepper_a4988.step_pulse_us = 2;
        }
        if (out->cfg.stepper_a4988.step_pulse_us > 20) {
            out->cfg.stepper_a4988.step_pulse_us = 20;
        }
        if (out->cfg.stepper_a4988.target_level < 0) {
            out->cfg.stepper_a4988.target_level = 0;
        }
        if (out->cfg.stepper_a4988.target_level > 100) {
            out->cfg.stepper_a4988.target_level = 100;
        }
        if (out->cfg.stepper_a4988.gpio_b < 0) {
            return ESP_ERR_INVALID_ARG;
        }
        out->cfg.stepper_a4988.target_position_steps =
            stepper_level_to_position(out->cfg.stepper_a4988.target_level, out->cfg.stepper_a4988.steps_range);
        out->cfg.stepper_a4988.current_position_steps = out->cfg.stepper_a4988.target_position_steps;
        out->cfg.stepper_a4988.current_level = out->cfg.stepper_a4988.target_level;
        out->cfg.stepper_a4988.home_active = false;
        out->cfg.stepper_a4988.homing = false;
        out->cfg.stepper_a4988.homed = false;
        out->cfg.stepper_a4988.moving = false;
        out->cfg.stepper_a4988.last_step_us = 0;

        gpio_config_t extra_io = {
            .pin_bit_mask = (1ULL << out->cfg.stepper_a4988.gpio_b) |
                            ((out->cfg.stepper_a4988.gpio_c >= 0) ? (1ULL << out->cfg.stepper_a4988.gpio_c) : 0),
            .mode = GPIO_MODE_OUTPUT,
            .pull_up_en = GPIO_PULLUP_DISABLE,
            .pull_down_en = GPIO_PULLDOWN_DISABLE,
            .intr_type = GPIO_INTR_DISABLE,
        };
        ESP_RETURN_ON_ERROR(gpio_config(&extra_io), TAG, "A4988 gpio setup failed for %s", out->id);
        ESP_RETURN_ON_ERROR(gpio_set_level((gpio_num_t)out->gpio, 0), TAG, "A4988 step gpio init failed for %s", out->id);
        if (out->cfg.stepper_a4988.home_gpio >= 0) {
            gpio_config_t home_io = {
                .pin_bit_mask = 1ULL << out->cfg.stepper_a4988.home_gpio,
                .mode = GPIO_MODE_INPUT,
                .pull_up_en = (out->cfg.stepper_a4988.home_pull_mode == GPIO_PULLUP_ONLY) ? GPIO_PULLUP_ENABLE : GPIO_PULLUP_DISABLE,
                .pull_down_en = (out->cfg.stepper_a4988.home_pull_mode == GPIO_PULLDOWN_ONLY) ? GPIO_PULLDOWN_ENABLE : GPIO_PULLDOWN_DISABLE,
                .intr_type = GPIO_INTR_DISABLE,
            };
            ESP_RETURN_ON_ERROR(gpio_config(&home_io), TAG, "A4988 home gpio setup failed for %s", out->id);
            if (stepper_a4988_home_active_locked(out)) {
                stepper_a4988_finish_home_locked(out);
                return ESP_OK;
            }
            if (out->cfg.stepper_a4988.auto_home_on_boot) {
                ESP_RETURN_ON_ERROR(stepper_a4988_start_home_locked(out), TAG, "A4988 home init failed for %s", out->id);
                return ESP_OK;
            }
        }
        if (out->cfg.stepper_a4988.hold_enabled) {
            ESP_RETURN_ON_ERROR(stepper_a4988_set_enable_locked(out, true), TAG, "A4988 enable init failed for %s", out->id);
            out->power = true;
        } else {
            ESP_RETURN_ON_ERROR(stepper_a4988_set_enable_locked(out, false), TAG, "A4988 disable init failed for %s", out->id);
            out->power = false;
        }
        return ESP_OK;
    }

    if (out->type == OUTPUT_TYPE_WS2812) {
        out->cfg.ws2812.pixel_count = jint(item, "pixel_count", 1);
        snprintf(out->cfg.ws2812.color_order, sizeof(out->cfg.ws2812.color_order), "%s",
                 jstr(item, "color_order", "GRB"));
        if (!ws2812_color_order_valid(out->cfg.ws2812.color_order)) {
            snprintf(out->cfg.ws2812.color_order, sizeof(out->cfg.ws2812.color_order), "%s", "GRB");
        }
        out->cfg.ws2812.default_power_on = jbool(item, "default_power_on", false);
        out->cfg.ws2812.gamma_correction = jbool(item, "gamma_correction", false);
        out->cfg.ws2812.mode = ws2812_mode_from_text(jstr(item, "mode", "rgb"));
        out->cfg.ws2812.transition_style = ws2812_transition_style_from_text(jstr(item, "transition_style", "none"));
        out->cfg.ws2812.transition_ms = jint(item, "transition_ms", 300);
        if (out->cfg.ws2812.transition_ms < 0) {
            out->cfg.ws2812.transition_ms = 0;
        }
        if (out->cfg.ws2812.transition_ms > 5000) {
            out->cfg.ws2812.transition_ms = 5000;
        }
        out->cfg.ws2812.level = out->cfg.ws2812.default_power_on ? WS2812_BRIGHTNESS_MAX : 0;
        out->cfg.ws2812.red = 255;
        out->cfg.ws2812.green = 255;
        out->cfg.ws2812.blue = 255;
        out->cfg.ws2812.applied_level = out->cfg.ws2812.level;
        out->cfg.ws2812.applied_red = out->cfg.ws2812.red;
        out->cfg.ws2812.applied_green = out->cfg.ws2812.green;
        out->cfg.ws2812.applied_blue = out->cfg.ws2812.blue;
        out->power = out->cfg.ws2812.default_power_on;
        led_strip_config_t strip_cfg = {
            .strip_gpio_num = out->gpio,
            .max_leds = (uint32_t)out->cfg.ws2812.pixel_count,
            .led_pixel_format = LED_PIXEL_FORMAT_GRB,
            .led_model = LED_MODEL_WS2812,
            .flags = {
                .invert_out = false,
            },
        };
        led_strip_rmt_config_t rmt_cfg = {
            .clk_src = RMT_CLK_SRC_DEFAULT,
            .resolution_hz = 10 * 1000 * 1000,
            // Keep WS2812 within one C3 RMT TX block so DS18B20 can still allocate its 1-Wire TX channel.
            .mem_block_symbols = SOC_RMT_MEM_WORDS_PER_CHANNEL,
            .flags = {
                .with_dma = false,
            },
        };
        ESP_RETURN_ON_ERROR(led_strip_new_rmt_device(&strip_cfg, &rmt_cfg, &out->cfg.ws2812.strip),
                            TAG, "WS2812 init failed for %s", out->id);
        out->supported = true;
        return render_ws2812_frame_locked(out, out->cfg.ws2812.applied_level,
                                          out->cfg.ws2812.applied_red,
                                          out->cfg.ws2812.applied_green,
                                          out->cfg.ws2812.applied_blue, -1);
    }

    return ESP_ERR_INVALID_ARG;
}

