klactrafob/esp32-c3_matter/src/core/modules.c
static esp_err_t configure_input(input_runtime_t *in, const cJSON *item)
{
    memset(in, 0, sizeof(*in));
    in->used = true;
    in->enabled = jbool(item, "enabled", true);
    in->gpio = jint(item, "gpio", -1);
    in->inverted = jbool(item, "inverted", false);
    in->pull_mode = pull_mode_from_text(jstr(item, "pull", "up"));
    snprintf(in->id, sizeof(in->id), "%s", jstr(item, "id", ""));
    snprintf(in->name, sizeof(in->name), "%s", jstr(item, "name", in->id));
    snprintf(in->role, sizeof(in->role), "%s", jstr(item, "role", "generic_binary"));

    if (!in->enabled) {
        return ESP_OK;
    }

    gpio_config_t io = {
        .pin_bit_mask = 1ULL << in->gpio,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = (in->pull_mode == GPIO_PULLUP_ONLY) ? GPIO_PULLUP_ENABLE : GPIO_PULLUP_DISABLE,
        .pull_down_en = (in->pull_mode == GPIO_PULLDOWN_ONLY) ? GPIO_PULLDOWN_ENABLE : GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    ESP_ERROR_CHECK(gpio_config(&io));
    in->state = gpio_get_level((gpio_num_t)in->gpio) != 0;
    if (in->inverted) {
        in->state = !in->state;
    }
    return ESP_OK;
}

static void parse_button_action(button_action_t *dst, const cJSON *src)
{
    memset(dst, 0, sizeof(*dst));
    dst->type = button_action_type_from_text(jstr(src, "type", "none"));
    snprintf(dst->target, sizeof(dst->target), "%s", jstr(src, "target", ""));
    dst->value = jbool(src, "value", false);
    dst->step = jint(src, "step", 10);
    if (dst->step < 1) {
        dst->step = 1;
    }
    if (dst->step > 100) {
        dst->step = 100;
    }
}

static esp_err_t configure_button(button_runtime_t *btn, const cJSON *item)
{
    memset(btn, 0, sizeof(*btn));
    btn->used = true;
    btn->enabled = jbool(item, "enabled", true);
    btn->gpio = jint(item, "gpio", -1);
    btn->inverted = jbool(item, "inverted", false);
    btn->pull_mode = pull_mode_from_text(jstr(item, "pull", "up"));
    btn->long_press_ms = jint(item, "long_press_ms", 1000);
    snprintf(btn->id, sizeof(btn->id), "%s", jstr(item, "id", ""));
    snprintf(btn->name, sizeof(btn->name), "%s", jstr(item, "name", btn->id));

    const cJSON *actions = jobj(item, "actions");
    parse_button_action(&btn->short_action, jobj(actions, "short"));
    parse_button_action(&btn->long_action, jobj(actions, "long"));

    if (!btn->enabled) {
        return ESP_OK;
    }

    gpio_config_t io = {
        .pin_bit_mask = 1ULL << btn->gpio,
        .mode = GPIO_MODE_INPUT,
        .pull_up_en = (btn->pull_mode == GPIO_PULLUP_ONLY) ? GPIO_PULLUP_ENABLE : GPIO_PULLUP_DISABLE,
        .pull_down_en = (btn->pull_mode == GPIO_PULLDOWN_ONLY) ? GPIO_PULLDOWN_ENABLE : GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_DISABLE,
    };
    ESP_ERROR_CHECK(gpio_config(&io));
    return ESP_OK;
}

static esp_err_t ensure_i2c_bus_locked(int sda_gpio, int scl_gpio, int freq_hz)
{
    if (s_runtime.i2c.bus) {
        if (s_runtime.i2c.sda_gpio == sda_gpio &&
            s_runtime.i2c.scl_gpio == scl_gpio &&
            s_runtime.i2c.freq_hz == freq_hz) {
            return ESP_OK;
        }
        return ESP_ERR_INVALID_STATE;
    }

    i2c_config_t conf = {
        .mode = I2C_MODE_MASTER,
        .sda_io_num = sda_gpio,
        .scl_io_num = scl_gpio,
        .sda_pullup_en = GPIO_PULLUP_ENABLE,
        .scl_pullup_en = GPIO_PULLUP_ENABLE,
        .master.clk_speed = (uint32_t)freq_hz,
    };
    s_runtime.i2c.bus = i2c_bus_create(MODULES_DEFAULT_I2C_PORT, &conf);
    if (!s_runtime.i2c.bus) {
        return ESP_FAIL;
    }

    s_runtime.i2c.active = true;
    s_runtime.i2c.sda_gpio = sda_gpio;
    s_runtime.i2c.scl_gpio = scl_gpio;
    s_runtime.i2c.freq_hz = freq_hz;
    return ESP_OK;
}

static esp_err_t ensure_ds18b20_bus_locked(const sensor_runtime_t *sensor)
{
    if (s_runtime.ds18b20.bus) {
        return ESP_OK;
    }

    onewire_bus_config_t bus_config = {
        .bus_gpio_num = sensor->gpio,
        .flags = {
            .en_pull_up = true,
        },
    };
    onewire_bus_rmt_config_t rmt_config = {
        .max_rx_bytes = 10,
    };
    ESP_RETURN_ON_ERROR(onewire_new_bus_rmt(&bus_config, &rmt_config, &s_runtime.ds18b20.bus),
                        TAG, "create 1-wire bus failed");

    s_runtime.ds18b20.active = true;
    s_runtime.ds18b20.gpio = sensor->gpio;
    s_runtime.ds18b20.poll_interval_sec = sensor->poll_interval_sec;
    s_runtime.ds18b20.next_poll_us = 0;
    snprintf(s_runtime.ds18b20.sensor_id, sizeof(s_runtime.ds18b20.sensor_id), "%s", sensor->id);
    snprintf(s_runtime.ds18b20.sensor_name, sizeof(s_runtime.ds18b20.sensor_name), "%s", sensor->name);

    return enumerate_ds18b20_devices_locked(sensor->gpio, NULL);
}

static esp_err_t enumerate_ds18b20_devices_locked(int gpio, bool *out_topology_changed)
{
    ds18b20_device_handle_t new_devices[MODULES_MAX_DS18B20] = {0};
    uint64_t new_addresses[MODULES_MAX_DS18B20] = {0};
    onewire_device_iter_handle_t iter = NULL;
    onewire_device_t dev = {0};
    int new_count = 0;
    bool topology_changed = false;

    if (out_topology_changed) {
        *out_topology_changed = false;
    }
    if (!s_runtime.ds18b20.bus) {
        return ESP_ERR_INVALID_STATE;
    }

    ESP_RETURN_ON_ERROR(onewire_new_device_iter(s_runtime.ds18b20.bus, &iter), TAG, "create 1-wire iterator failed");
    while (new_count < MODULES_MAX_DS18B20 && onewire_device_iter_get_next(iter, &dev) == ESP_OK) {
        ds18b20_config_t ds_cfg = {};
        if (ds18b20_new_device_from_enumeration(&dev, &ds_cfg, &new_devices[new_count]) == ESP_OK) {
            (void)ds18b20_set_resolution(new_devices[new_count], DS18B20_RESOLUTION_12B);
            new_addresses[new_count] = dev.address;
            new_count++;
        }
    }
    (void)onewire_del_device_iter(iter);

    if (new_count != s_runtime.ds18b20.device_count) {
        topology_changed = true;
    } else {
        for (int i = 0; i < new_count; ++i) {
            if (new_addresses[i] != s_runtime.ds18b20.addresses[i]) {
                topology_changed = true;
                break;
            }
        }
    }

