klactrafob/esp32-c3_matter/src/core/modules.c
    for (int i = 0; i < s_runtime.ds18b20.device_count; ++i) {
        if (s_runtime.ds18b20.devices[i]) {
            (void)ds18b20_del_device(s_runtime.ds18b20.devices[i]);
        }
    }
    memset(s_runtime.ds18b20.devices, 0, sizeof(s_runtime.ds18b20.devices));
    memset(s_runtime.ds18b20.addresses, 0, sizeof(s_runtime.ds18b20.addresses));
    memset(s_runtime.ds18b20.valid, 0, sizeof(s_runtime.ds18b20.valid));
    memset(s_runtime.ds18b20.temperatures, 0, sizeof(s_runtime.ds18b20.temperatures));

    for (int i = 0; i < new_count; ++i) {
        s_runtime.ds18b20.devices[i] = new_devices[i];
        s_runtime.ds18b20.addresses[i] = new_addresses[i];
    }
    s_runtime.ds18b20.device_count = new_count;
    if (out_topology_changed) {
        *out_topology_changed = topology_changed;
    }

    ESP_LOGI(TAG, "Discovered %d DS18B20 device(s) on GPIO%d", new_count, gpio);
    return ESP_OK;
}

static esp_err_t configure_sensor(sensor_runtime_t *sensor, const cJSON *item)
{
    memset(sensor, 0, sizeof(*sensor));
    sensor->used = true;
    sensor->enabled = jbool(item, "enabled", true);
    sensor->supported = false;
    snprintf(sensor->id, sizeof(sensor->id), "%s", jstr(item, "id", ""));
    snprintf(sensor->name, sizeof(sensor->name), "%s", jstr(item, "name", sensor->id));
    snprintf(sensor->type, sizeof(sensor->type), "%s", jstr(item, "type", ""));
    sensor->gpio = jint(item, "gpio", -1);
    sensor->sda_gpio = jint(item, "sda_gpio", -1);
    sensor->scl_gpio = jint(item, "scl_gpio", -1);
    sensor->address = jint(item, "address", 0);
    sensor->poll_interval_sec = jint(item, "poll_interval_sec", 30);
    sensor->next_poll_us = 0;
    if (sensor->poll_interval_sec < 2) {
        sensor->poll_interval_sec = 2;
    }

    if (!sensor->enabled) {
        return ESP_OK;
    }

    if (strcmp(sensor->type, "ds18b20_bus") == 0) {
        sensor->supported = true;
        return ensure_ds18b20_bus_locked(sensor);
    }

    ESP_RETURN_ON_ERROR(ensure_i2c_bus_locked(sensor->sda_gpio, sensor->scl_gpio,
                                              jint(item, "freq_hz", 100000)),
                        TAG, "i2c bus init failed");

    if (strcmp(sensor->type, "aht20") == 0) {
        aht20_i2c_config_t conf = {
            .bus_inst = s_runtime.i2c.bus,
            .i2c_addr = (uint8_t)sensor->address,
        };
        ESP_RETURN_ON_ERROR(aht20_new_sensor(&conf, &sensor->dev.aht20), TAG, "aht20 init failed");
        sensor->supported = true;
        return ESP_OK;
    }
    if (strcmp(sensor->type, "sht3x") == 0) {
        sensor->dev.sht3x = sht3x_create(s_runtime.i2c.bus, (uint8_t)sensor->address);
        if (!sensor->dev.sht3x) {
            return ESP_FAIL;
        }
        ESP_RETURN_ON_ERROR(sht3x_soft_reset(sensor->dev.sht3x), TAG, "sht3x reset failed");
        sensor->supported = true;
        return ESP_OK;
    }
    if (strcmp(sensor->type, "bme280") == 0) {
        sensor->dev.bme280 = bme280_create(s_runtime.i2c.bus, (uint8_t)sensor->address);
        if (!sensor->dev.bme280) {
            return ESP_FAIL;
        }
        ESP_RETURN_ON_ERROR(bme280_default_init(sensor->dev.bme280), TAG, "bme280 init failed");
        sensor->supported = true;
        return ESP_OK;
    }

    return ESP_ERR_NOT_SUPPORTED;
}

static bool button_is_pressed(const button_runtime_t *btn)
{
    bool pressed = gpio_get_level((gpio_num_t)btn->gpio) != 0;
    if (btn->inverted) {
        pressed = !pressed;
    }
    return pressed;
}

static esp_err_t execute_button_action_locked(const button_action_t *action)
{
    if (!action) {
        return ESP_ERR_INVALID_ARG;
    }

    switch (action->type) {
        case ACTION_MASTER_ON:
            return set_master_output_locked(true);
        case ACTION_MASTER_OFF:
            return set_master_output_locked(false);
        case ACTION_MASTER_TOGGLE:
            return set_master_output_locked(!is_any_output_on_locked());
        case ACTION_TOGGLE_OUTPUT: {
            output_runtime_t *out = find_output_locked(action->target);
            if (!out) {
                return ESP_ERR_NOT_FOUND;
            }
            return set_output_power_locked(out, !out->power);
        }
        case ACTION_SET_OUTPUT: {
            output_runtime_t *out = find_output_locked(action->target);
            if (!out) {
                return ESP_ERR_NOT_FOUND;
            }
            return set_output_power_locked(out, action->value);
        }
        case ACTION_DIM_STEP_UP:
        case ACTION_DIM_STEP_DOWN: {
            output_runtime_t *out = find_output_locked(action->target);
            if (!out) {
                return ESP_ERR_NOT_FOUND;
            }
            if (!output_supports_level_control(out)) {
                return ESP_ERR_INVALID_ARG;
            }
            int level = 0;
            if (out->type == OUTPUT_TYPE_PWM) {
                level = out->cfg.pwm.level;
            } else if (out->type == OUTPUT_TYPE_WS2812) {
                level = ws2812_percent_from_brightness(out->cfg.ws2812.level);
            } else if (out->type == OUTPUT_TYPE_SERVO_3WIRE) {
                level = out->cfg.servo_3wire.level;
            } else if (out->type == OUTPUT_TYPE_SERVO_5WIRE) {
                level = out->cfg.servo_5wire.target_level;
            } else if (out->type == OUTPUT_TYPE_STEPPER_28BYJ) {
                level = out->cfg.stepper_28byj.target_level;
            } else if (out->type == OUTPUT_TYPE_STEPPER_A4988) {
                level = out->cfg.stepper_a4988.target_level;
            }
            level += (action->type == ACTION_DIM_STEP_UP) ? action->step : -action->step;
            return set_output_level_locked(out, level);
        }
        case ACTION_NONE:
            return ESP_OK;
        default:
            return ESP_ERR_INVALID_ARG;
    }
}

static esp_err_t read_sensor_locked(sensor_runtime_t *sensor)
{
    if (!sensor || !sensor->enabled || !sensor->supported) {
        return ESP_ERR_INVALID_STATE;
    }

    esp_err_t err = ESP_OK;
    if (strcmp(sensor->type, "aht20") == 0) {
        uint32_t t_raw = 0;
        uint32_t h_raw = 0;
        err = aht20_read_temperature_humidity(sensor->dev.aht20, &t_raw, &sensor->temperature_c, &h_raw, &sensor->humidity_pct);
        sensor->data_valid = (err == ESP_OK);
        return err;
    }
    if (strcmp(sensor->type, "sht3x") == 0) {
        err = sht3x_get_single_shot(sensor->dev.sht3x, &sensor->temperature_c, &sensor->humidity_pct);
        sensor->data_valid = (err == ESP_OK);
        return err;
    }
    if (strcmp(sensor->type, "bme280") == 0) {
        err = bme280_read_temperature(sensor->dev.bme280, &sensor->temperature_c);
        if (err == ESP_OK) {
            err = bme280_read_humidity(sensor->dev.bme280, &sensor->humidity_pct);
        }
        if (err == ESP_OK) {
            err = bme280_read_pressure(sensor->dev.bme280, &sensor->pressure_hpa);
            if (err == ESP_OK) {
                sensor->pressure_hpa /= 100.0f;
            }
        }
        sensor->data_valid = (err == ESP_OK);
        return err;
    }
    return ESP_ERR_NOT_SUPPORTED;
}

static esp_err_t read_ds18b20_locked(bool *out_topology_changed)
{
    if (out_topology_changed) {
        *out_topology_changed = false;
    }
    if (!s_runtime.ds18b20.active || !s_runtime.ds18b20.bus) {
        return ESP_ERR_INVALID_STATE;
    }
    if (s_runtime.ds18b20.device_count == 0) {
        bool topology_changed = false;
        ESP_RETURN_ON_ERROR(enumerate_ds18b20_devices_locked(s_runtime.ds18b20.gpio, &topology_changed),
                            TAG, "ds18 bus rescan failed");
        if (out_topology_changed) {
            *out_topology_changed = topology_changed;
        }
        if (s_runtime.ds18b20.device_count == 0) {
            return ESP_ERR_NOT_FOUND;
        }
    }

    app_watchdog_reset_current_task("modules_sensor");
    ESP_RETURN_ON_ERROR(ds18b20_trigger_temperature_conversion_for_all(s_runtime.ds18b20.bus),
                        TAG, "ds18 conversion failed");

