klactrafob/esp32-c3_matter/src/core/modules.c
    for (int i = 0; i < s_runtime.ds18b20.device_count; ++i) {
        app_watchdog_reset_current_task("modules_sensor");
        esp_err_t err = ds18b20_get_temperature(s_runtime.ds18b20.devices[i], &s_runtime.ds18b20.temperatures[i]);
        s_runtime.ds18b20.valid[i] = (err == ESP_OK);
        if (err != ESP_OK) {
            ESP_LOGW(TAG, "DS18B20[%016" PRIX64 "] read failed: %s",
                     (uint64_t)s_runtime.ds18b20.addresses[i], esp_err_to_name(err));
        }
    }

    return ESP_OK;
}

static void modules_poll_task(void *arg)
{
    (void)arg;
    app_watchdog_register_current_task("modules_poll");

    while (1) {
        bool changed = false;
        int64_t now_us = esp_timer_get_time();

        xSemaphoreTake(s_lock, portMAX_DELAY);
        update_ws2812_transitions_locked(now_us);
        for (int i = 0; i < s_runtime.output_count; ++i) {
            output_runtime_t *out = &s_runtime.outputs[i];
            if (!out->used || !out->enabled || !out->test_active) {
                continue;
            }
            if (process_output_test_locked(out, now_us)) {
                changed = true;
            }
        }
        for (int i = 0; i < s_runtime.output_count; ++i) {
            output_runtime_t *out = &s_runtime.outputs[i];
            if (!out->used || !out->enabled || out->type != OUTPUT_TYPE_SERVO_5WIRE) {
                continue;
            }
            if (update_servo_5wire_control_locked(out, now_us)) {
                changed = true;
            }
        }
        for (int i = 0; i < s_runtime.output_count; ++i) {
            output_runtime_t *out = &s_runtime.outputs[i];
            if (!out->used || !out->enabled || out->type != OUTPUT_TYPE_SERVO_3WIRE) {
                continue;
            }
            if (update_servo_3wire_release_locked(out, now_us)) {
                changed = true;
            }
        }
        for (int i = 0; i < s_runtime.output_count; ++i) {
            output_runtime_t *out = &s_runtime.outputs[i];
            if (!out->used || !out->enabled) {
                continue;
            }
            if (out->type == OUTPUT_TYPE_CLOCK_4X4094) {
                if (update_clock_4x4094_locked(out, now_us)) {
                    changed = true;
                }
            } else if (out->type == OUTPUT_TYPE_STEPPER_28BYJ) {
                if (update_stepper_28byj_control_locked(out, now_us)) {
                    changed = true;
                }
            } else if (out->type == OUTPUT_TYPE_STEPPER_A4988) {
                if (update_stepper_a4988_control_locked(out, now_us)) {
                    changed = true;
                }
            }
        }
        for (int i = 0; i < s_runtime.input_count; ++i) {
            input_runtime_t *in = &s_runtime.inputs[i];
            if (!in->used || !in->enabled) {
                continue;
            }
            bool state = gpio_get_level((gpio_num_t)in->gpio) != 0;
            if (in->inverted) {
                state = !state;
            }
            if (state != in->state) {
                in->state = state;
                changed = true;
            }
        }

        for (int i = 0; i < s_runtime.button_count; ++i) {
            button_runtime_t *btn = &s_runtime.buttons[i];
            if (!btn->used || !btn->enabled) {
                continue;
            }
            bool pressed = button_is_pressed(btn);

            if (pressed && !btn->last_pressed) {
                btn->pressed_since_us = now_us;
                btn->long_sent = false;
            } else if (!pressed && btn->last_pressed) {
                int held_ms = (btn->pressed_since_us > 0) ? (int)((now_us - btn->pressed_since_us) / 1000) : 0;
                if (!btn->long_sent && held_ms >= 40) {
                    if (execute_button_action_locked(&btn->short_action) == ESP_OK) {
                        changed = true;
                    }
                }
                btn->pressed_since_us = 0;
            } else if (pressed && !btn->long_sent && btn->pressed_since_us > 0) {
                int held_ms = (int)((now_us - btn->pressed_since_us) / 1000);
                if (held_ms >= btn->long_press_ms) {
                    btn->long_sent = true;
                    if (execute_button_action_locked(&btn->long_action) == ESP_OK) {
                        changed = true;
                    }
                }
            }

            btn->last_pressed = pressed;
        }
        xSemaphoreGive(s_lock);

        if (changed) {
            notify_runtime_changed();
        }

        app_watchdog_reset_current_task("modules_poll");
        vTaskDelay(pdMS_TO_TICKS(MODULES_POLL_PERIOD_MS));
    }
}

static void modules_sensor_task(void *arg)
{
    (void)arg;
    app_watchdog_register_current_task("modules_sensor");

    while (1) {
        bool changed = false;
        int64_t now_us = esp_timer_get_time();

        xSemaphoreTake(s_lock, portMAX_DELAY);
        if (s_runtime.ds18b20.active &&
            (s_runtime.ds18b20.next_poll_us == 0 || now_us >= s_runtime.ds18b20.next_poll_us)) {
            bool topology_changed = false;
            if (read_ds18b20_locked(&topology_changed) == ESP_OK || topology_changed) {
                changed = true;
            }
            s_runtime.ds18b20.next_poll_us = esp_timer_get_time() +
                                             ((int64_t)s_runtime.ds18b20.poll_interval_sec * 1000000LL);
        }

        for (int i = 0; i < s_runtime.sensor_count; ++i) {
            sensor_runtime_t *sensor = &s_runtime.sensors[i];
            if (!sensor->used || !sensor->enabled || !sensor->supported) {
                continue;
            }
            if (strcmp(sensor->type, "ds18b20_bus") == 0) {
                continue;
            }
            if (sensor->next_poll_us != 0 && now_us < sensor->next_poll_us) {
                continue;
            }
            if (read_sensor_locked(sensor) == ESP_OK) {
                changed = true;
            }
            sensor->next_poll_us = esp_timer_get_time() + ((int64_t)sensor->poll_interval_sec * 1000000LL);
            app_watchdog_reset_current_task("modules_sensor");
        }
        xSemaphoreGive(s_lock);

        if (changed) {
            notify_runtime_changed();
        }

        app_watchdog_reset_current_task("modules_sensor");
        vTaskDelay(pdMS_TO_TICKS(MODULES_SENSOR_TASK_PERIOD_MS));
    }
}

static esp_err_t set_master_output_locked(bool on)
{
    bool any = false;
    for (int i = 0; i < s_runtime.output_count; ++i) {
        output_runtime_t *out = &s_runtime.outputs[i];
        if (!out->used || !out->enabled || !output_supports_power_control(out)) {
            continue;
        }
        if (set_output_power_locked(out, on) == ESP_OK) {
            any = true;
        }
    }
    return any ? ESP_OK : ESP_ERR_INVALID_STATE;
}

static bool is_any_output_on_locked(void)
{
    for (int i = 0; i < s_runtime.output_count; ++i) {
        const output_runtime_t *out = &s_runtime.outputs[i];
        if (out->used && out->enabled && output_supports_power_control(out) && out->power) {
            return true;
        }
    }
    return false;
}

