klactrafob/esp32-c3_matter/src/core/modules.c
static cJSON *build_output_status_json(const output_runtime_t *out)
{
    cJSON *obj = cJSON_CreateObject();
    cJSON_AddStringToObject(obj, "id", out->id);
    cJSON_AddStringToObject(obj, "name", out->name);
    cJSON_AddStringToObject(obj, "type", output_type_to_text(out->type));
    if (out->role[0]) {
        cJSON_AddStringToObject(obj, "role", out->role);
    }
    if ((out->type == OUTPUT_TYPE_SERVO_3WIRE || out->type == OUTPUT_TYPE_SERVO_5WIRE) &&
        out->mqtt_component[0]) {
        cJSON_AddStringToObject(obj, "mqtt_component", out->mqtt_component);
    }
    if ((out->type == OUTPUT_TYPE_SERVO_3WIRE || out->type == OUTPUT_TYPE_SERVO_5WIRE) &&
        out->mqtt_number_mode[0]) {
        cJSON_AddStringToObject(obj, "mqtt_number_mode", out->mqtt_number_mode);
    }
    cJSON_AddBoolToObject(obj, "enabled", out->enabled);
    cJSON_AddBoolToObject(obj, "supported", out->supported);
    cJSON_AddNumberToObject(obj, "gpio", out->gpio);
    cJSON_AddBoolToObject(obj, "power", out->power);
    cJSON_AddBoolToObject(obj, "test_active", out->test_active);

    if (out->type == OUTPUT_TYPE_RELAY) {
        cJSON_AddNumberToObject(obj, "active_level", out->cfg.relay.active_level);
    } else if (out->type == OUTPUT_TYPE_PWM) {
        cJSON_AddNumberToObject(obj, "level", out->cfg.pwm.level);
        cJSON_AddNumberToObject(obj, "freq_hz", out->cfg.pwm.freq_hz);
        cJSON_AddNumberToObject(obj, "max_level_pct", out->cfg.pwm.max_level_pct);
        cJSON_AddBoolToObject(obj, "inverted", out->cfg.pwm.inverted);
        if (out->cfg.pwm.power_relay_gpio >= 0) {
            cJSON_AddNumberToObject(obj, "power_relay_gpio", out->cfg.pwm.power_relay_gpio);
            cJSON_AddNumberToObject(obj, "power_relay_active_level", out->cfg.pwm.power_relay_active_level);
            cJSON_AddBoolToObject(obj, "power_relay_on", out->power && out->cfg.pwm.level > 0);
        }
    } else if (out->type == OUTPUT_TYPE_WS2812) {
        cJSON_AddNumberToObject(obj, "level", ws2812_percent_from_brightness(out->cfg.ws2812.level));
        cJSON_AddNumberToObject(obj, "brightness", out->cfg.ws2812.level);
        cJSON_AddNumberToObject(obj, "pixel_count", out->cfg.ws2812.pixel_count);
        cJSON_AddStringToObject(obj, "mode", ws2812_mode_to_text(out->cfg.ws2812.mode));
        cJSON_AddStringToObject(obj, "color_order", out->cfg.ws2812.color_order);
        cJSON_AddBoolToObject(obj, "gamma_correction", out->cfg.ws2812.gamma_correction);
        cJSON_AddStringToObject(obj, "transition_style", ws2812_transition_style_to_text(out->cfg.ws2812.transition_style));
        cJSON_AddNumberToObject(obj, "transition_ms", out->cfg.ws2812.transition_ms);
        if (out->cfg.ws2812.mode == WS2812_MODE_RGB) {
            cJSON *color = cJSON_AddObjectToObject(obj, "color");
            cJSON_AddNumberToObject(color, "r", out->cfg.ws2812.red);
            cJSON_AddNumberToObject(color, "g", out->cfg.ws2812.green);
            cJSON_AddNumberToObject(color, "b", out->cfg.ws2812.blue);
        }
    } else if (out->type == OUTPUT_TYPE_SERVO_3WIRE) {
        cJSON_AddNumberToObject(obj, "level", out->cfg.servo_3wire.level);
        cJSON_AddNumberToObject(obj, "min_us", out->cfg.servo_3wire.min_us);
        cJSON_AddNumberToObject(obj, "max_us", out->cfg.servo_3wire.max_us);
        cJSON_AddNumberToObject(obj, "hold_power_ms", out->cfg.servo_3wire.hold_power_ms);
        cJSON_AddBoolToObject(obj, "reverse_direction", out->cfg.servo_3wire.reverse_direction);
    } else if (out->type == OUTPUT_TYPE_SERVO_5WIRE) {
        cJSON_AddNumberToObject(obj, "level", out->cfg.servo_5wire.current_level);
        cJSON_AddNumberToObject(obj, "target_level", out->cfg.servo_5wire.target_level);
        cJSON_AddNumberToObject(obj, "gpio_b", out->cfg.servo_5wire.gpio_b);
        cJSON_AddNumberToObject(obj, "feedback_gpio", out->cfg.servo_5wire.feedback_gpio);
        cJSON_AddNumberToObject(obj, "feedback_raw", out->cfg.servo_5wire.feedback_raw);
        cJSON_AddNumberToObject(obj, "feedback_min_raw", out->cfg.servo_5wire.feedback_min_raw);
        cJSON_AddNumberToObject(obj, "feedback_max_raw", out->cfg.servo_5wire.feedback_max_raw);
        cJSON_AddNumberToObject(obj, "deadband_pct", out->cfg.servo_5wire.deadband_pct);
        cJSON_AddNumberToObject(obj, "move_timeout_ms", out->cfg.servo_5wire.move_timeout_ms);
        cJSON_AddBoolToObject(obj, "reverse_direction", out->cfg.servo_5wire.reverse_direction);
        cJSON_AddBoolToObject(obj, "moving", out->cfg.servo_5wire.moving);
        cJSON_AddBoolToObject(obj, "timed_out", out->cfg.servo_5wire.timed_out);
    } else if (out->type == OUTPUT_TYPE_CLOCK_4X4094) {
        cJSON_AddNumberToObject(obj, "level", out->cfg.clock_4x4094.level);
        cJSON_AddNumberToObject(obj, "brightness", (out->cfg.clock_4x4094.level * 255) / 100);
        cJSON_AddNumberToObject(obj, "gpio_b", out->cfg.clock_4x4094.gpio_b);
        cJSON_AddNumberToObject(obj, "gpio_c", out->cfg.clock_4x4094.gpio_c);
        if (out->cfg.clock_4x4094.brightness_gpio >= 0) {
            cJSON_AddNumberToObject(obj, "brightness_gpio", out->cfg.clock_4x4094.brightness_gpio);
        }
        cJSON_AddNumberToObject(obj, "timezone_offset_min", out->cfg.clock_4x4094.timezone_offset_min);
        cJSON_AddNumberToObject(obj, "blink_period_ms", out->cfg.clock_4x4094.blink_period_ms);
        cJSON_AddBoolToObject(obj, "default_on", out->cfg.clock_4x4094.default_on);
        cJSON_AddBoolToObject(obj, "common_anode", out->cfg.clock_4x4094.common_anode);
        cJSON_AddBoolToObject(obj, "mirror_segments", out->cfg.clock_4x4094.mirror_segments);
        cJSON_AddBoolToObject(obj, "reverse_digits", out->cfg.clock_4x4094.reverse_digits);
        cJSON_AddBoolToObject(obj, "leading_zero", out->cfg.clock_4x4094.leading_zero);
        cJSON_AddBoolToObject(obj, "blink_separator", out->cfg.clock_4x4094.blink_separator);
        cJSON_AddNumberToObject(obj, "segment_a", out->cfg.clock_4x4094.segment_map[0] + 1);
        cJSON_AddNumberToObject(obj, "segment_b", out->cfg.clock_4x4094.segment_map[1] + 1);
        cJSON_AddNumberToObject(obj, "segment_c", out->cfg.clock_4x4094.segment_map[2] + 1);
        cJSON_AddNumberToObject(obj, "segment_d", out->cfg.clock_4x4094.segment_map[3] + 1);
        cJSON_AddNumberToObject(obj, "segment_e", out->cfg.clock_4x4094.segment_map[4] + 1);
        cJSON_AddNumberToObject(obj, "segment_f", out->cfg.clock_4x4094.segment_map[5] + 1);
        cJSON_AddNumberToObject(obj, "segment_g", out->cfg.clock_4x4094.segment_map[6] + 1);
        cJSON_AddNumberToObject(obj, "segment_dp", out->cfg.clock_4x4094.segment_map[7] + 1);
        cJSON_AddBoolToObject(obj, "time_valid", out->cfg.clock_4x4094.time_valid);
        cJSON_AddBoolToObject(obj, "separator_on", out->cfg.clock_4x4094.separator_on);
        cJSON_AddStringToObject(obj, "display_text", out->cfg.clock_4x4094.display_text);
        if (out->cfg.clock_4x4094.display_hour >= 0) {
            cJSON_AddNumberToObject(obj, "display_hour", out->cfg.clock_4x4094.display_hour);
            cJSON_AddNumberToObject(obj, "display_minute", out->cfg.clock_4x4094.display_minute);
        }
    } else if (out->type == OUTPUT_TYPE_STEPPER_28BYJ) {
        cJSON_AddNumberToObject(obj, "level", out->cfg.stepper_28byj.current_level);
        cJSON_AddNumberToObject(obj, "target_level", out->cfg.stepper_28byj.target_level);
        if (output_is_cover(out)) {
            cJSON_AddNumberToObject(obj, "position", out->cfg.stepper_28byj.current_level);
            cJSON_AddNumberToObject(obj, "target_position", out->cfg.stepper_28byj.target_level);
            cJSON_AddStringToObject(obj, "state", cover_state_text_locked(out));
        }
        cJSON_AddNumberToObject(obj, "gpio_b", out->cfg.stepper_28byj.gpio_b);
        cJSON_AddNumberToObject(obj, "gpio_c", out->cfg.stepper_28byj.gpio_c);
        cJSON_AddNumberToObject(obj, "gpio_d", out->cfg.stepper_28byj.gpio_d);
        if (out->cfg.stepper_28byj.home_gpio >= 0) {
            cJSON_AddNumberToObject(obj, "home_gpio", out->cfg.stepper_28byj.home_gpio);
            cJSON_AddStringToObject(obj, "home_pull", pull_mode_to_text(out->cfg.stepper_28byj.home_pull_mode));
        }
        cJSON_AddNumberToObject(obj, "steps_range", out->cfg.stepper_28byj.steps_range);
        cJSON_AddNumberToObject(obj, "speed_steps_per_sec", out->cfg.stepper_28byj.speed_steps_per_sec);
        cJSON_AddNumberToObject(obj, "position_steps", out->cfg.stepper_28byj.current_position_steps);
        cJSON_AddNumberToObject(obj, "target_position_steps", out->cfg.stepper_28byj.target_position_steps);
        cJSON_AddBoolToObject(obj, "reverse_direction", out->cfg.stepper_28byj.reverse_direction);
        cJSON_AddBoolToObject(obj, "hold_enabled", out->cfg.stepper_28byj.hold_enabled);
        cJSON_AddBoolToObject(obj, "home_inverted", out->cfg.stepper_28byj.home_inverted);
        cJSON_AddBoolToObject(obj, "auto_home_on_boot", out->cfg.stepper_28byj.auto_home_on_boot);
        cJSON_AddBoolToObject(obj, "home_active", out->cfg.stepper_28byj.home_active);
        cJSON_AddBoolToObject(obj, "homing", out->cfg.stepper_28byj.homing);
        cJSON_AddBoolToObject(obj, "homed", out->cfg.stepper_28byj.homed);
        cJSON_AddBoolToObject(obj, "moving", out->cfg.stepper_28byj.moving);
    } else if (out->type == OUTPUT_TYPE_STEPPER_A4988) {
        cJSON_AddNumberToObject(obj, "level", out->cfg.stepper_a4988.current_level);
        cJSON_AddNumberToObject(obj, "target_level", out->cfg.stepper_a4988.target_level);
        if (output_is_cover(out)) {
            cJSON_AddNumberToObject(obj, "position", out->cfg.stepper_a4988.current_level);
            cJSON_AddNumberToObject(obj, "target_position", out->cfg.stepper_a4988.target_level);
            cJSON_AddStringToObject(obj, "state", cover_state_text_locked(out));
        }
        cJSON_AddNumberToObject(obj, "gpio_b", out->cfg.stepper_a4988.gpio_b);
        if (out->cfg.stepper_a4988.gpio_c >= 0) {
            cJSON_AddNumberToObject(obj, "gpio_c", out->cfg.stepper_a4988.gpio_c);
            cJSON_AddNumberToObject(obj, "enable_active_level", out->cfg.stepper_a4988.enable_active_level);
        }
        if (out->cfg.stepper_a4988.home_gpio >= 0) {
            cJSON_AddNumberToObject(obj, "home_gpio", out->cfg.stepper_a4988.home_gpio);
            cJSON_AddStringToObject(obj, "home_pull", pull_mode_to_text(out->cfg.stepper_a4988.home_pull_mode));
        }
        cJSON_AddNumberToObject(obj, "steps_range", out->cfg.stepper_a4988.steps_range);
        cJSON_AddNumberToObject(obj, "speed_steps_per_sec", out->cfg.stepper_a4988.speed_steps_per_sec);
        cJSON_AddNumberToObject(obj, "step_pulse_us", out->cfg.stepper_a4988.step_pulse_us);
        cJSON_AddNumberToObject(obj, "position_steps", out->cfg.stepper_a4988.current_position_steps);
        cJSON_AddNumberToObject(obj, "target_position_steps", out->cfg.stepper_a4988.target_position_steps);
        cJSON_AddBoolToObject(obj, "reverse_direction", out->cfg.stepper_a4988.reverse_direction);
        cJSON_AddBoolToObject(obj, "hold_enabled", out->cfg.stepper_a4988.hold_enabled);
        cJSON_AddBoolToObject(obj, "home_inverted", out->cfg.stepper_a4988.home_inverted);
        cJSON_AddBoolToObject(obj, "auto_home_on_boot", out->cfg.stepper_a4988.auto_home_on_boot);
        cJSON_AddBoolToObject(obj, "home_active", out->cfg.stepper_a4988.home_active);
        cJSON_AddBoolToObject(obj, "homing", out->cfg.stepper_a4988.homing);
        cJSON_AddBoolToObject(obj, "homed", out->cfg.stepper_a4988.homed);
        cJSON_AddBoolToObject(obj, "moving", out->cfg.stepper_a4988.moving);
    }
    return obj;
}

static cJSON *build_input_status_json(const input_runtime_t *in)
{
    cJSON *obj = cJSON_CreateObject();
    cJSON_AddStringToObject(obj, "id", in->id);
    cJSON_AddStringToObject(obj, "name", in->name);
    cJSON_AddStringToObject(obj, "role", in->role);
    cJSON_AddBoolToObject(obj, "enabled", in->enabled);
    cJSON_AddNumberToObject(obj, "gpio", in->gpio);
    cJSON_AddBoolToObject(obj, "state", in->state);
    return obj;
}

static cJSON *build_button_status_json(const button_runtime_t *btn)
{
    cJSON *obj = cJSON_CreateObject();
    cJSON_AddStringToObject(obj, "id", btn->id);
    cJSON_AddStringToObject(obj, "name", btn->name);
    cJSON_AddBoolToObject(obj, "enabled", btn->enabled);
    cJSON_AddNumberToObject(obj, "gpio", btn->gpio);
    cJSON_AddNumberToObject(obj, "long_press_ms", btn->long_press_ms);
    cJSON_AddBoolToObject(obj, "pressed", btn->last_pressed);
    cJSON *actions = cJSON_AddObjectToObject(obj, "actions");
    cJSON *short_a = cJSON_AddObjectToObject(actions, "short");
    cJSON_AddStringToObject(short_a, "type", button_action_type_to_text(btn->short_action.type));
    cJSON_AddStringToObject(short_a, "target", btn->short_action.target);
    cJSON *long_a = cJSON_AddObjectToObject(actions, "long");
    cJSON_AddStringToObject(long_a, "type", button_action_type_to_text(btn->long_action.type));
    cJSON_AddStringToObject(long_a, "target", btn->long_action.target);
    return obj;
}

