klactrafob/esp32-c3_matter/src/core/modules.c
static cJSON *build_sensor_status_json(const sensor_runtime_t *sensor)
{
    cJSON *obj = cJSON_CreateObject();
    cJSON_AddStringToObject(obj, "id", sensor->id);
    cJSON_AddStringToObject(obj, "name", sensor->name);
    cJSON_AddStringToObject(obj, "type", sensor->type);
    cJSON_AddBoolToObject(obj, "enabled", sensor->enabled);
    cJSON_AddBoolToObject(obj, "supported", sensor->supported);
    cJSON_AddStringToObject(obj, "status",
                            sensor->supported ? (sensor->data_valid || strcmp(sensor->type, "ds18b20_bus") == 0 ? "ready" : "waiting_data")
                                              : "driver_unavailable");
    if (sensor->gpio >= 0) {
        cJSON_AddNumberToObject(obj, "gpio", sensor->gpio);
    }
    if (sensor->sda_gpio >= 0) {
        cJSON_AddNumberToObject(obj, "sda_gpio", sensor->sda_gpio);
        cJSON_AddNumberToObject(obj, "scl_gpio", sensor->scl_gpio);
        cJSON_AddNumberToObject(obj, "address", sensor->address);
    }
    if (sensor->data_valid) {
        if (strcmp(sensor->type, "aht20") == 0 || strcmp(sensor->type, "sht3x") == 0 || strcmp(sensor->type, "bme280") == 0) {
            cJSON_AddNumberToObject(obj, "temperature_c", sensor->temperature_c);
            cJSON_AddNumberToObject(obj, "humidity_pct", sensor->humidity_pct);
        }
        if (strcmp(sensor->type, "bme280") == 0) {
            cJSON_AddNumberToObject(obj, "pressure_hpa", sensor->pressure_hpa);
        }
    }
    if (strcmp(sensor->type, "ds18b20_bus") == 0) {
        cJSON *devices = cJSON_AddArrayToObject(obj, "devices");
        for (int i = 0; i < s_runtime.ds18b20.device_count; ++i) {
            cJSON *dev = cJSON_CreateObject();
            char dev_id[48] = {0};
            char dev_name[64] = {0};
            snprintf(dev_id, sizeof(dev_id), "%s_%016" PRIX64, sensor->id, (uint64_t)s_runtime.ds18b20.addresses[i]);
            snprintf(dev_name, sizeof(dev_name), "%s %d", sensor->name, i + 1);
            cJSON_AddStringToObject(dev, "id", dev_id);
            cJSON_AddStringToObject(dev, "name", dev_name);
            cJSON_AddStringToObject(dev, "metric", "temperature_c");
            cJSON_AddStringToObject(dev, "address", dev_id + strlen(sensor->id) + 1);
            cJSON_AddBoolToObject(dev, "valid", s_runtime.ds18b20.valid[i]);
            if (s_runtime.ds18b20.valid[i]) {
                cJSON_AddNumberToObject(dev, "temperature_c", s_runtime.ds18b20.temperatures[i]);
            }
            cJSON_AddItemToArray(devices, dev);
        }
    }
    return obj;
}

esp_err_t modules_init(void)
{
    if (!s_lock) {
        s_lock = xSemaphoreCreateMutex();
        if (!s_lock) {
            return ESP_ERR_NO_MEM;
        }
    }

    if (!s_poll_task) {
        if (xTaskCreate(modules_poll_task, "modules_poll", 4096, NULL, 4, &s_poll_task) != pdPASS) {
            return ESP_FAIL;
        }
    }

    if (!s_sensor_task) {
        if (xTaskCreate(modules_sensor_task, "modules_sensor", 6144, NULL, 4, &s_sensor_task) != pdPASS) {
            return ESP_FAIL;
        }
    }

    return ESP_OK;
}

esp_err_t modules_apply_config(const cJSON *cfg)
{
    esp_err_t err = ESP_OK;

    if (!cfg) {
        set_last_error("Configuration is null");
        return ESP_ERR_INVALID_ARG;
    }

    clear_last_error();
    xSemaphoreTake(s_lock, portMAX_DELAY);
    clear_runtime_locked();

    const cJSON *outputs = jobj(cfg, "outputs");
    const cJSON *inputs = jobj(cfg, "inputs");
    const cJSON *buttons = jobj(cfg, "buttons");
    const cJSON *sensors = jobj(cfg, "sensors");
    ledc_allocator_t ledc_alloc = {0};

    if (cJSON_IsArray((cJSON *)outputs)) {
        s_runtime.output_count = cJSON_GetArraySize((cJSON *)outputs);
        if (s_runtime.output_count > MODULES_MAX_OUTPUTS) {
            s_runtime.output_count = MODULES_MAX_OUTPUTS;
        }
        for (int i = 0; i < s_runtime.output_count; ++i) {
            err = configure_output(&s_runtime.outputs[i], cJSON_GetArrayItem((cJSON *)outputs, i), &ledc_alloc);
            if (err != ESP_OK) {
                ESP_LOGE(TAG, "Failed to configure output %d (%s): %s", i,
                         s_runtime.outputs[i].id[0] ? s_runtime.outputs[i].id : "<unnamed>",
                         esp_err_to_name(err));
                set_last_error("output %s: %s",
                               s_runtime.outputs[i].id[0] ? s_runtime.outputs[i].id : "<unnamed>",
                               esp_err_to_name(err));
                goto fail;
            }
        }
    }

    if (cJSON_IsArray((cJSON *)inputs)) {
        s_runtime.input_count = cJSON_GetArraySize((cJSON *)inputs);
        if (s_runtime.input_count > MODULES_MAX_INPUTS) {
            s_runtime.input_count = MODULES_MAX_INPUTS;
        }
        for (int i = 0; i < s_runtime.input_count; ++i) {
            err = configure_input(&s_runtime.inputs[i], cJSON_GetArrayItem((cJSON *)inputs, i));
            if (err != ESP_OK) {
                ESP_LOGE(TAG, "Failed to configure input %d (%s): %s", i,
                         s_runtime.inputs[i].id[0] ? s_runtime.inputs[i].id : "<unnamed>",
                         esp_err_to_name(err));
                set_last_error("input %s: %s",
                               s_runtime.inputs[i].id[0] ? s_runtime.inputs[i].id : "<unnamed>",
                               esp_err_to_name(err));
                goto fail;
            }
        }
    }

    if (cJSON_IsArray((cJSON *)buttons)) {
        s_runtime.button_count = cJSON_GetArraySize((cJSON *)buttons);
        if (s_runtime.button_count > MODULES_MAX_BUTTONS) {
            s_runtime.button_count = MODULES_MAX_BUTTONS;
        }
        for (int i = 0; i < s_runtime.button_count; ++i) {
            err = configure_button(&s_runtime.buttons[i], cJSON_GetArrayItem((cJSON *)buttons, i));
            if (err != ESP_OK) {
                ESP_LOGE(TAG, "Failed to configure button %d (%s): %s", i,
                         s_runtime.buttons[i].id[0] ? s_runtime.buttons[i].id : "<unnamed>",
                         esp_err_to_name(err));
                set_last_error("button %s: %s",
                               s_runtime.buttons[i].id[0] ? s_runtime.buttons[i].id : "<unnamed>",
                               esp_err_to_name(err));
                goto fail;
            }
        }
    }

    if (cJSON_IsArray((cJSON *)sensors)) {
        s_runtime.sensor_count = cJSON_GetArraySize((cJSON *)sensors);
        if (s_runtime.sensor_count > MODULES_MAX_SENSORS) {
            s_runtime.sensor_count = MODULES_MAX_SENSORS;
        }
        for (int i = 0; i < s_runtime.sensor_count; ++i) {
            err = configure_sensor(&s_runtime.sensors[i], cJSON_GetArrayItem((cJSON *)sensors, i));
            if (err != ESP_OK) {
                ESP_LOGE(TAG, "Failed to configure sensor %d (%s): %s", i,
                         s_runtime.sensors[i].id[0] ? s_runtime.sensors[i].id : "<unnamed>",
                         esp_err_to_name(err));
                set_last_error("sensor %s: %s",
                               s_runtime.sensors[i].id[0] ? s_runtime.sensors[i].id : "<unnamed>",
                               esp_err_to_name(err));
                goto fail;
            }
        }
    }

    xSemaphoreGive(s_lock);
    notify_runtime_changed();
    ESP_LOGI(TAG, "Applied runtime config: outputs=%d inputs=%d buttons=%d sensors=%d",
             s_runtime.output_count, s_runtime.input_count, s_runtime.button_count, s_runtime.sensor_count);
    return ESP_OK;

