klactrafob/esp32-c3_matter/src/core/modules.c
fail:
    clear_runtime_locked();
    xSemaphoreGive(s_lock);
    return err;
}

cJSON *modules_build_status_json(void)
{
    cJSON *root = cJSON_CreateObject();
    cJSON *outputs = cJSON_AddArrayToObject(root, "outputs");
    cJSON *inputs = cJSON_AddArrayToObject(root, "inputs");
    cJSON *buttons = cJSON_AddArrayToObject(root, "buttons");
    cJSON *sensors = cJSON_AddArrayToObject(root, "sensors");

    xSemaphoreTake(s_lock, portMAX_DELAY);
    for (int i = 0; i < s_runtime.output_count; ++i) {
        cJSON_AddItemToArray(outputs, build_output_status_json(&s_runtime.outputs[i]));
    }
    for (int i = 0; i < s_runtime.input_count; ++i) {
        cJSON_AddItemToArray(inputs, build_input_status_json(&s_runtime.inputs[i]));
    }
    for (int i = 0; i < s_runtime.button_count; ++i) {
        cJSON_AddItemToArray(buttons, build_button_status_json(&s_runtime.buttons[i]));
    }
    for (int i = 0; i < s_runtime.sensor_count; ++i) {
        cJSON_AddItemToArray(sensors, build_sensor_status_json(&s_runtime.sensors[i]));
    }
    cJSON_AddBoolToObject(root, "any_output_on", is_any_output_on_locked());
    xSemaphoreGive(s_lock);

    return root;
}

esp_err_t modules_action(const char *id, const cJSON *action, cJSON **out_response)
{
    if (!id || !action || !out_response) {
        return ESP_ERR_INVALID_ARG;
    }

    esp_err_t err = ESP_ERR_NOT_FOUND;
    cJSON *resp = NULL;

    xSemaphoreTake(s_lock, portMAX_DELAY);

    if (strcmp(id, "master") == 0) {
        const char *cmd = jstr(action, "command", "");
        if (strcmp(cmd, "on") == 0) {
            err = set_master_output_locked(true);
        } else if (strcmp(cmd, "off") == 0) {
            err = set_master_output_locked(false);
        } else if (strcmp(cmd, "toggle") == 0) {
            err = set_master_output_locked(!is_any_output_on_locked());
        } else {
            err = ESP_ERR_INVALID_ARG;
        }
        if (err == ESP_OK) {
            resp = cJSON_CreateObject();
            cJSON_AddBoolToObject(resp, "any_output_on", is_any_output_on_locked());
        }
    } else {
        output_runtime_t *out = find_output_locked(id);
        if (out) {
            const char *cmd = jstr(action, "command", "");
            if (jbool(action, "test", false)) {
                err = start_output_test_locked(out, jint(action, "duration_ms", 1200));
            } else if (jbool(action, "home", false) || strcmp(cmd, "home") == 0) {
                if (out->type == OUTPUT_TYPE_STEPPER_28BYJ) {
                    err = stepper_28byj_start_home_locked(out);
                } else if (out->type == OUTPUT_TYPE_STEPPER_A4988) {
                    err = stepper_a4988_start_home_locked(out);
                } else {
                    err = ESP_ERR_NOT_SUPPORTED;
                }
            } else if (strcmp(cmd, "open") == 0) {
                err = set_output_level_locked(out, 100);
            } else if (strcmp(cmd, "close") == 0) {
                err = set_output_level_locked(out, 0);
            } else if (strcmp(cmd, "stop") == 0) {
                if (out->type == OUTPUT_TYPE_STEPPER_28BYJ) {
                    err = stepper_28byj_stop_locked(out);
                } else if (out->type == OUTPUT_TYPE_STEPPER_A4988) {
                    err = stepper_a4988_stop_locked(out);
                } else if (out->type == OUTPUT_TYPE_SERVO_3WIRE) {
                    out->cfg.servo_3wire.release_at_us = 0;
                    err = set_output_power_locked(out, false);
                } else if (out->type == OUTPUT_TYPE_SERVO_5WIRE) {
                    err = servo_5wire_set_drive_locked(out, 0);
                    if (err == ESP_OK) {
                        out->cfg.servo_5wire.target_level = out->cfg.servo_5wire.current_level;
                        out->cfg.servo_5wire.moving = false;
                        out->cfg.servo_5wire.timed_out = false;
                        out->cfg.servo_5wire.drive_started_us = 0;
                        out->power = false;
                    }
                } else {
                    err = ESP_ERR_NOT_SUPPORTED;
                }
            } else if (jbool(action, "toggle", false)) {
                err = set_output_power_locked(out, !out->power);
            } else {
                const cJSON *set = jobj(action, "set");
                const cJSON *set_level = jobj(action, "set_level");
                const cJSON *set_brightness = jobj(action, "set_brightness");
                const cJSON *color = jobj(action, "color");
                bool handled = false;
                err = ESP_OK;

                if (cJSON_IsBool(set)) {
                    err = set_output_power_locked(out, cJSON_IsTrue(set));
                    handled = true;
                }
                if (err == ESP_OK && cJSON_IsNumber(set_level)) {
                    err = set_output_level_locked(out, set_level->valueint);
                    handled = true;
                }
                if (err == ESP_OK && out->type == OUTPUT_TYPE_WS2812 && cJSON_IsNumber(set_brightness)) {
                    err = set_output_brightness_locked(out, set_brightness->valueint);
                    handled = true;
                }
                if (err == ESP_OK && out->type == OUTPUT_TYPE_WS2812 && cJSON_IsObject((cJSON *)color)) {
                    if (out->cfg.ws2812.mode == WS2812_MODE_RGB) {
                        out->cfg.ws2812.red = (uint8_t)jint(color, "r", out->cfg.ws2812.red);
                        out->cfg.ws2812.green = (uint8_t)jint(color, "g", out->cfg.ws2812.green);
                        out->cfg.ws2812.blue = (uint8_t)jint(color, "b", out->cfg.ws2812.blue);
                    }
                    err = output_apply_physical_state(out);
                    handled = true;
                }
                if (!handled) {
                    err = ESP_ERR_INVALID_ARG;
                }
            }

            if (err == ESP_OK) {
                resp = build_output_status_json(out);
            }
        } else {
            input_runtime_t *in = find_input_locked(id);
            if (in) {
                resp = build_input_status_json(in);
                err = ESP_OK;
            }
        }
    }

    xSemaphoreGive(s_lock);

    if (err == ESP_OK) {
        *out_response = resp;
        notify_runtime_changed();
        return ESP_OK;
    }

    if (resp) {
        cJSON_Delete(resp);
    }
    return err;
}

esp_err_t modules_set_master_output(bool on)
{
    esp_err_t err;
    xSemaphoreTake(s_lock, portMAX_DELAY);
    err = set_master_output_locked(on);
    xSemaphoreGive(s_lock);
    if (err == ESP_OK) {
        notify_runtime_changed();
    }
    return err;
}

bool modules_is_any_output_on(void)
{
    bool on = false;
    xSemaphoreTake(s_lock, portMAX_DELAY);
    on = is_any_output_on_locked();
    xSemaphoreGive(s_lock);
    return on;
}

void modules_set_runtime_callback(modules_runtime_callback_t cb, void *ctx)
{
    s_runtime_cb = cb;
    s_runtime_cb_ctx = ctx;
}
